[{
  "_id": {
    "$oid": "60a7fc5f3caf2bc26219c05c"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "There was a marriage in the townland of Curragraigue. After the usual festivities, and when the guests were left to themselves, and were drinking to the prosperity of the bride and bridegroom, they were startled by the appearance of the man himself rushing into the room with anguish in his looks.\"Oh!\" cried he, \"Margaret is carried away by the fairies, I'm sure. The girls were not left the room for half a minute when I went in, and there is no more sign of her there than if she never was born.\"Great consternation prevailed, great search was made, but no Margaret was to be found. After a night and day spent in misery, the poor bridegroom laid down to take some rest. In a while he seemed to himself to awake from a troubled dream, and look out into the room. The moon was shining in through the window, and in the middle of the slanting rays stood Margaret in her white bridal clothes. He thought to speak and leap out of the bed, but his tongue was without utterance, and his limbs unable to move.\"Do not be disturbed, dear husband,\" said the appearance; \"I am now in the power of the fairies, but if you only have courage and prudence we may be soon happy with each other again. Next Friday will be May-eve, and the whole court will ride out of the old fort after midnight. I must be there along with the rest. Sprinkle a circle with holy water, and have a black-hafted knife with you. If you have courage to pull me off the horse, and draw me into the ring, all they can do will be useless. You must have some food for me every night on the dresser, for if I taste one mouthful with them, I will be lost to you forever. The fairies got power over me because I was only thinking of you, and did not prepare myself as I ought for the sacrament. I made a bad confession, and now I am suffering for it. Don't forget what I have said.\"\"Oh, no, my darling,\" cried he, recovering his speech, but by the time he had slipped out of bed, there was no living soul in the room but himself.Till Friday night the poor young husband spent a desolate time. The food was left on the dresser over night, and it rejoiced all hearts to find it vanished by morning. A little before midnight he was at the entrance of the old rath. He formed the circle, took his station within it, and kept the black-hafted knife ready for service. At times he was nervously afraid of losing his dear wife, and at others burning with impatience for the struggle.At last the old fort with its dark high bushy fences cutting against the sky, was in a moment replaced by a palace and its court. A thousand lights flashed from the windows and lofty hall entrance; numerous torches were brandished by attendants stationed round the courtyard; and a numerous cavalcade of richly attired ladies and gentlemen was moving in the direction of the gate where he found himself standing.As they rode by him laughing and jesting, he could not tell whether they were aware of his presence or not. He looked intent at each countenance as it approached, but it was some time before he caught sight of the dear face and figure borne along on a milk-white steed. She recognized him well enough, and her features now broke into a smile -- now expressed deep anxiety.She was unable for the throng to guide the animal close to the ring of power; so he suddenly rushed out of his bounds, seized her in his arms, and lifted her off. Cries of rage and fury arose on every side; they were hemmed in, and weapons were directed at his head and breast to terrify him. He seemed to be inspired with superhuman courage and force, and wielding the powerful knife he soon cleared a space round him, all seeming dismayed by the sight of the weapon. He lost no time, but drew his wife within the ring, within which none of the myriads round dared to enter. Shouts of derision and defiance continued to fill the air for some time, but the expedition could not be delayed.As the end of the procession filed past the gate and the circle within which the mortal pair held each other determinedly clasped, darkness and silence fell on the old rath and the fields round it, and the rescued bride and her lover breathed freely. We will not detain the sensitive reader on the happy walk home, on the joy that hailed their arrival, and on all the eager gossip that occupied the townland and the five that surround it for a month after the happy rescue."
},{
  "_id": {
    "$oid": "60a7fca33caf2bc26219c05d"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "I was serving my time to the cattle trade, with a man the name of Lynch -- God be good to him! I suppose I was no more than twelve years of age at the time. 'Twas a very out of the way place and mountainy.Well, not far from my master's house there was a family of the Brogans. 'Twas the will of God that Mrs. Brogan took sick, and there was a baby born, but the poor woman died. Well, the sister, a younger girl than the woman that died, came to nurse the child. After some time she began to look very delicate and uneasy. The naghbours were beginning to talk amongs themselves about her, and it came to Brogan's ears, and, begor, it made him vexed. So he asked the sister what was up with her.\"Well, John,\" says she, \"I did not like to tell you, but Ellie\" -- that was the name of the dead woman -- \"comes every night, and takes the baby and nurses it, and goes away without a word.\"\"By my word,\" says John, \"she is not dead at all, but taken, and I will watch her to-night.\"Good enough, he remained up, and about 12 o'clock in she came, and he put his arms around her, but as he said, felt no substance.\"You can't keep me now,\" says she, \"for I'm married agin; but if you come to the Bottle Hill field to-morrow night, there will be about 40 of us goin' t'words Blarney, and we will all be on horses, with our husbands. All the horses will be white, and I and my man will be last. Bring a hazel stick woud [with] you and strike the horse on the right side, and I will fall off. Just as I fall, ketch me with all your might. You will know my man, for he is the only one of them that has a red head.\"Well, he went, and he must have a great heart, for on they come, gallopin' like mad. Just as the man with the red head's horse came he stood one-side and struck. She fell and he gripped her like iron. Well, such a hullabaloo as there was, was never heard, and all the other men makin' game of the red-headed man.Well, he brought her home, and they lived for years after, and had a good family, and were the happiest people around the place. I often see some of her children; of course they are all married now, and gone here and there, but that's as true as my name is Tim Brosnan."
},{
  "_id": {
    "$oid": "60a7fd0d3caf2bc26219c05e"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "I had a gran'uncle, he was a shoemaker; he was only about 3 or 4 months married. I'm up to fourscore now. Well, God rest all their souls, for they are all gone, I hope to a better world!Well, sir, he says to his wife, and a purty girl she was, as I hear um say, -- the fortune wasn't very big but 'twould buy him a good bit of leather, and I might tell you, 'twas all brogues that was worn at the time, and faith, you should be big before you would get them same.Howisever, he started one day for Limerick would [with] and ass and car, to bring home leather and other little things he wanted. He did not return that night or the next, nor the next. Begor, the wife and some frinds went to Limerick next day, but no trace of the husband could be found. I forgot to tell you that the third morning after he was gone the wife rose very early, and there at the dure [door] was the ass and car. The whole country was searched, up high and low down, but no trace. Weeks, monts and years came and went, but he never turned up.Now the wife kept on a little business, sellin' nick-nacks to support herself, and a son, that grew to be a fine strapping man, as I hear um say, the picture of his father.Now, sir, the boy was in or about twenty, when one day, himself and his mother were atin' their dinner, whin in comes a man and says, \"God save ye!\"\"And you too,\" says the mother. \"Will you ate a spud, sir?\" says she.He rached for the spud, and in doin' so the sleeve of his coat shortned as he reached out his hand. He had a mole on his wrist and she see it, and her husband had one in the same spot.\"Good God!\" says she, \"are you John M'Namara?\" -- for that was his name.\"I am,\" says he, \"and your husband, and that's my son, but I can't tell you for some time where I was since I left you. But some time I might have the power, but not now.\"Well, lo and behold you, in a week's time he started to work, and the boots he made were a surprise to the whole country round, and I believe he lived for nine or ten years ater that, but he never tould her or any one where he was, but of course everbody knew that 'twas wood [with] the good people."
},{
  "_id": {
    "$oid": "60a7fd623caf2bc26219c05f"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "The fairies, as we know, are greatly attracted by the beauty of mortal women, and Finvarra the king employs his numerous sprites to find out and carry off when possible the prettiest girls and brides in the country. These are spirited away by enchantment to his fairy palace at Knockma in Tuam, where they remain under a fairy spell, forgetting all about the earthly life and soothed to passive enjoyment, as in a sweet dream, by the soft low melody of the fairy music, which has the power to lull the hearer into a trance of ecstasy.There was once a great lord in that part of the country who had a beautiful wife called Ethna, the loveliest bride in all the land. And her husband was so proud of her that day after day he had festivals in her honour; and from morning till night his castle was filled with lords and ladies, and nothing but music and dancing and feasting and hunting and pleasure was thought of.One evening while the feast was merriest, and Ethna floated through the dance in her robe of silver gossamer clasped with jewels, more bright and beautiful than the stars in heaven, she suddenly let go the hand of her partner and sank to the floor in a faint.They carried her to her room, where she lay long quite insensible; but towards the morning she woke up and declared that she had passed the night in a beautiful palace, and was so happy that she longed to sleep again and go there in her dreams. And they watched by her all day, but when the shades of evening fell dark on the castle, low music was heard at her window, and Ethna again fell into a deep trance from which nothing could rouse her.Then her old nurse was set to watch her; but the woman grew weary in the silence and fell asleep, and never awoke till the sun had risen. And when she looked towards the bed, she saw to her horror that the young bride had disappeared. The whole household was roused up at once, and search made everywhere, but no trace of her could be found in all the castle, nor in the gardens, nor in the park. Her husband sent messengers in every direction, but to no purpose -- no one had seen her; no sign of her could be found, living or dead.Then the young lord mounted his swiftest steed and galloped right off to Knockma, to question Finvarra, the fairy king, if he could give any tidings of the bride, or direct him where to search for her; for he and Finvarra were friends, and many a good keg of Spanish wine had been left outside the window of the castle at night for the fairies to carry away, by order of the young lord. But he little dreamed now that Finvarra himself was the traitor; so he galloped on like mad till he reached Knockma, the hill of the fairies.And as he stopped to rest his horse by the fairy rath, he heard voices in the air above him, and one said, \"Right glad is Finvarra now, for he has the beautiful bride in his palace at last; and never more will she see her husband's face.\"\"Yet,\" answered another, \"if he dig down through the hill to the centre of the earth, he would find his bride; but the work is hard and the way is difficult, and Finvarra has more power than any mortal man.\"\"That is yet to be seen,\" exclaimed the young lord. \"Neither fairy, nor devil, nor Finvarra himself shall stand between me and my fair young wife;\" and on the instant he sent word by his servants to gather together all the workmen and labourers of the country round with their spades and pickaxes, to dig through the hill till they came to the fairy palace.And the workmen came, a great crowd of them, and they dug through the hill all that day till a great deep trench was made down to the very centre. Then at sunset they left off for the night; but next morning when they assembled again to continue their work, behold, all the clay was put back again into the trench, and the hill looked as if never a spade had touched it -- for so Finvarra had ordered; and he was powerful over earth and air and sea.But the young lord had a brave heart, and he made the men go on with the work; and the trench was dug again, wide and deep into the centre of the hill. And this went on for three days, but always with the same result, for the clay was put back again each night and the hill looked the same as before, and they were no nearer to the fairy palace.Then the young lord was ready to die for rage and grief, but suddenly he heard a voice near him like a whisper in the air, and the words it said were these: \"Sprinkle the earth you have dug up with salt, and your work will be safe.\"On this new life came into his heart, and lie sent word through all the country to gather salt from the people; and the clay was sprinkled with it that night, when the men had left off their work at the hill.Next morning they all rose up early in great anxiety to see what had happened, and there to their great joy was the trench all safe, just as they had left it, and all the earth round it was untouched.Then the young lord knew he had power over Finvarra, and he bade the men work on with a good heart, for they would soon reach the fairy palace now in the centre of the hill. So by the next day a great glen was cut right through deep down to the middle of the earth, and they could hear the fairy music if they put their ear close to the ground, and voices were heard round them in the air.\"See now,\" said one, \"Finvarra is sad, for if one of those mortal men strike a blow on the fairy palace with their spades, it will crumble to dust, and fade away like the mist.\"\"Then let Finvarra give up the bride,\" said another, \"and we shall be safe.\"On which the voice of Finvarra himself was heard, clear like the note of a silver bugle through the hill. \"Stop your work,\" he said. \"Oh, men of earth, lay down your spades, and at sunset the bride shall be given back to her husband. I, Finvarra, have spoken.\"Then the young lord bade them stop the work, and lay down their spades till the sun went down. And at sunset he mounted his great chestnut steed and rode to the head of the glen, and watched and waited; and just as the red light flushed all the sky, lie saw his wife coming along the path in her robe of silver gossamer, more beautiful than ever; and he sprang from the saddle and lifted her up before him, and rode away like the storm wind back to the castle. And there they laid Ethna on her bed; but she closed her eyes and spake no word. So day after day passed, and still she never spake or smiled, but seemed like one in a trance.And great sorrow fell upon every one, for they feared she had eaten of the fairy food, and that the enchantment would never be btoken. So her husband was very miserable. But one evening as he was riding home late, he heard voices in the air, and one of them said, \"It is now a year and a day since the young lord brought home his beautiful wife from Finvarra; but what good is she to him? She is speechless and like one dead; for her spirit is with the fairies though her form is there beside him.\"Then another voice answered, \"And so she will remain unless the spell is broken. He must unloose the girdle from her waist that is fastened with an enchanted pin, and burn the girdle with fire, and throw the ashes before the door, and bury the enchanted pin in the earth; then will her spirit come back from Fairyland, and she will once more speak and have true life.\"Hearing this the young lord at once set spurs to his horse, and on reaching the castle hastened to the room where Ethna lay on her couch silent and beautiful like a waxen figure. Then, being determined to test the truth of the spirit voices, he untied the girdle, and after much difficulty extracted the enchanted pin from the folds. But still Ethna spoke no word; then he took the girdle and burned it with fire, and strewed the ashes before the door, and he buried the enchanted pin in a deep hole in the earth, under a fairy thorn, that no hand might disturb the spot. After which he returned to his young wife, who smiled as she looked at him, aud held forth her hand. Great was his joy to see the soul coming back to the beautiful form, and he raised her up and kissed her; and speech and memory came back to her at that moment, and all her former life, just as if it had never been broken or interrupted; but the year that her spirit had passed in Fairyland seemed to her but as a dream of the night, from which she had just awoke.After this Finvarra made no further efforts to carry her off; but the deep cut in the hill remains to this day, and is called \"The Fairy's Glen.\" So no one can doubt the truth of the story as here narrated."
},{
  "_id": {
    "$oid": "60a7fd873caf2bc26219c060"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "One Edward Jones, or \"Ned the Jockey\", as he was familiarly called, resided, within the memory of the writer, in one of the roadside cottages a short distance from Llanidloes, on the Newtown Road.While returning home late one evening, it was his fate to fall in with a troop of fairies, who were not pleased to have their gambols disturbed by a mortal. Requesting him to depart, they politely offered him the choice of three means of locomotion, viz., being carried off by a \"high wind, middle wind, or low wind.\" The jockey soon made up his mind, and elected to make his trip through the air by the assistance of a high wind.No sooner had he given his decision, than he found himself whisked high up into the air, and his senses completely bewildered by the rapidity of his flight; he did not recover himself again till he came in contact with the earth, being suddenly dropped in the middle of a garden near Ty Gough, on the Bryndu Road, many miles distant from the spot whence he started on his aerial journey.Ned, when relating this story, would vouch for its genuineness in the most solemn manner, and the person who narrated it to the writer brought forward, as a proof of its truth, \"that there was not the slightest trace of any person going into the garden while Ned was found in the middle of it.\"The ultimate fate of the hero of the above incident was extremely melancholy. Returning home inebriated one night, he appears to have mistaken his road, and walked into the Severn, just below the Long Bridge, where his body was found next morning."
},{
  "_id": {
    "$oid": "60a7fda53caf2bc26219c061"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "Many years ago the Welsh mountains were full of fairies. People used to go by moonlight to see them dancing, for they knew where they would dance by seeing green rings in the grass.There was an old man living in those days who used to frequent the fairs that were held across the mountains. One day he was crossing the mountains to a fair, and when he got to a lonely valley he sat down, for he was tired, and he dropped off to sleep, and his bag fell down by his side. When he was sound asleep the fairies came and carried him off, bag and all, and took him under the earth, and when he awoke he found himself in a great palace of gold, full of fairies dancing and singing. And they took him and showed him everything, the splendid gold room and gardens, and they kept dancing round him until he fell asleep.When he was asleep they carried him back to the same spot where they had found him, and when he awoke he thought he had been dreaming, so he looked for his bag, and got hold of it, but he could hardly lift it. When he opened it he found it was nearly filled with gold.He managed to pick it up, and turning round, he went home.When he got home, his wife Kaddy said, \"What's to do, why haven't you been to the fair?\"\"I've got something here,\" he said, and showed his wife the gold.\"Why, where did you get that?\"But he wouldn't tell her. Since she was curious, like all women, she kept worrying him all night -- for he'd put the money in a box under the bed -- so he told her about the fairies.Next morning, when he awoke, he thought he'd go to the fair and buy a lot of things, and he went to the box to get some of the gold, but found it full of cockle-shells."
},{
  "_id": {
    "$oid": "60a7fdcf3caf2bc26219c062"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "One bright moonlight night, while on his way to Clogwyn y Gwin to see his sweetheart, one of the sons of Llwyn On, in Nant y Bettws, saw a group of fairies carousing and dancing to their heart's content, on a field by Llyn Cawellyn. He went and stood not far from them, and by degrees he was drawn, by the charming sweetness of their music, and by the nimble and lively manner of their sport, until he was right within their circle. Soon there fell upon him a certain charm, which made everything around him strange to him, and he found himself in one of the most beautiful countries he had ever seen, where everyone spent his time in nothing but joy and mirth. He had been there for seven years, and yet everything was but as a dream of the night; but he remembered the message on which he had set out, and his heart longed for his sweetheart. He therefore asked permission to return home, which was given him together with a whole host of companions to lead to his own country; and all of a sudden he found himself, as if awaking out of a dream, on the meadow on which the fairies were carrying on their sport.He then turned his face homeward, but when he reached there all was changed: his parents were dead, his brothers and sisters could not recognize him, and his sweetheart was married to another. At the thought of such changes he broke his heart, and died in less than a week after his return."
},{
  "_id": {
    "$oid": "60a7fe0b3caf2bc26219c063"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "John Roy, who lived in Glenbroun, in the parish of Abernethy, being out one night on the hills in search of his cattle, met a troop of fairies, who seemed to have got a prize of some sort or other. Recollecting that the fairies are obliged to exchange whatever they may have with any one who offers them anything, however low in value, for it, he flung his bonnet to them, crying Shuis slo slumus sheen (i.e., mine is yours and yours is mine). The fairies dropped their booty, which proved to be a Sassenach (English) lady whom the dwellers of Shian of Coir-laggac had carried away from her own country, leaving a stock in her place which, of course, died and was buried.John brought her home, and she lived for many years in his house.\"It happened, however, in the course of time,\" said the Gaelic narrator, \"that the new king found it necessary to make the great roads through these countries by means of soldiers, for the purpose of letting coaches and carriages pass to the northern cities; and those soldiers had officers and commanders in the same way as our fighting army have now. Those soldiers were never great favorites in these countries, particularly during the time that our kings were alive; and consequently it was no easy matter for them, either officers or men, to procure for themselves comfortable quarters.\"But John Roy would not keep up the national animosity to the cottan dearg (red-coats), and he offered a residence in his house to a Saxon captain and his son. When there they could not take their eyes off the English lady, and the son remarked to his father what a strong likeness she bore to his deceased mother.The father replied that he too had been struck with the resemblance, and said he could almost fancy she was his wife. He then mentioned her name and those of some persons connected with them. The lady by these words at once recognized her husband and son, and honest John Roy had the satisfaction of reuniting the long-separated husband and wife, and receiving their most grateful acknowledgments."
},{
  "_id": {
    "$oid": "60a7fe443caf2bc26219c064"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "One night a number of fishermen quartered themselves in a hut by a fishing village on the northwest shores of an island. After they had gone to bed, and while they were yet awake, they saw a white, dew-besprinkled woman's hand reaching in through the door. They well understood that their visitor was a sea nymph, who sought their destruction, and feigned unconsciousness of her presence.The following day their number was added to by the coming of a young, courageous and newly married man from Kinnar, in Lummelund. When they related to him their adventure of the night before, he made fun of their being afraid to take a beautiful woman by the hand, and boasted that if he had been present he would not have neglected to grasp the proffered hand.That evening when they laid themselves down in the same room, the late arrival with them, the door opened again, and a plump, white woman's arm, with a most beautiful hand, reached in over the sleepers.The young man arose from his bed, approached the door and seized the outstretched hand, impelled, perhaps, more by the fear of his comrades scoffing at his boasted bravery, than by any desire for a closer acquaintance with the strange visitor.Immediately his comrades witnessed him drawn noiselessly out through the door, which closed softly after him. They thought he would return soon, but when morning approached and he did not appear, they set out in search of him. Far and near the search was pursued, but without success. His disappearance was complete.Three years passed and nothing had been heard of the missing man. His young wife, who had mourned him all this time as dead, was finally persuaded to marry another. On the evening of the wedding day, while the mirth was at its highest, a stranger entered the cottage. Upon closer observation some of the guests thought they recognized the bride's former husband.The utmost surprise and commotion followed.In answer to the inquiries of those present as to where he came from and where he had been, he related that it was a sea nymph whose hand he had taken that night when he left the fisherman's hut; and that he was dragged by her down into the sea. In her pearly halls he forgot his wife, parents, and all that was loved by him until the morning of that day, when the sea nymph exclaimed, \"There will be a dusting out in Kinnar this evening.\"Then his senses immediately returned, and, with anxiety, he asked, \"Then it is my wife who is to be the bride?\"The sea nymph replied in the affirmative.At his urgent request, she allowed him to come up to see his wife as a bride, stipulating that when he arrived at the house he should not enter. When he came and saw her adorned with garland and crown he could, nevertheless, not resist the desire to enter. Then came a tempest and took away half the roof of the house, whereupon the man fell sick and three days later died."
},{
  "_id": {
    "$oid": "60a7fe653caf2bc26219c065"
  },
  "link": "http://www.pitt.edu/~dash/abduct.html#recovered",
  "tags": [
    "mythology",
    "mystery",
    "fiction"
  ],
  "text": "As a smith was at work in his forge late one evening, he heard great wailing out on the road, and by the light of the red-hot iron that he was hammering, he saw a woman whom a troll was driving along, bawling at her \"A little more! A little more!\" He ran out, put the red-hot iron between them, and thus delivered her from the power of the troll.He led her into his house and that night she was delivered of twins.In the morning he waited on [went to] her husband, who he supposed must be in great affliction at the loss of his wife. But to his surprise he saw there, in bed, a woman the very image of her he had saved from the troll. Knowing at once what she must be, he raised an axe he had in his hand, and cleft her skull.The matter was soon explained to the satisfaction of the husband, who gladly received his real wife and her twins."
},{
  "_id": {
    "$oid": "60a7ffe23caf2bc26219c066"
  },
  "link": "https://www.norsemyth.org/",
  "tags": [
    "mythology",
    "religion",
    "christianity",
    "fiction",
    "mystery"
  ],
  "text": "Every so often, one of the college students in my Norse mythology classes raises a hand and asks, “Which eye did Odin give up to drink from Mimir’s well?”Related questions include which side of Hel’s face is the corpse side, what the size measurements of Freyja’s cats are, and what the design specifications of Loki’s mistletoe missile are.My first, gut reaction to this type of question was to reply that mythology functions differently from fantasy.Myth is vague where modern fantasy novels give page after page of specific details. Myth is elusive and allusive where tabletop role-playing games qualify and quantify every characteristic feature in overwhelming detail. Myth compresses action into stark imagery where video games expand conflict into endless hyperreal performances.Students raised on Harry Potter, Dungeons & Dragons, and World of Warcraft may find mythology disappointingly diffuse. So many myths lack direct speech or dialogue in the modern sense. There is often no sense of the characters having inner lives, and motivations can range from totally banal to utterly incomprehensible.In Norse mythology, physical descriptions of mythological figures are few. Some of the details we are sure we have read are actually akin to mass hallucinations, as in the widespread idea that Thor has a red beard in the Eddas. He does not.The image of the red-bearded Viking Thor comes from the Icelandic sagas, historical and fantastic prose fiction composed two centuries and more after the nation’s public conversion to Christianity and written in imitation of new forms of literature filtering up from the Christian continent.Red Thor appears in strikingly Christian contexts, as a threatening figure of the pagan past who seeks to flip new converts back to the Old Way. Any similarities to the red devil are purely non-coincidental.Yet the meme of the red-bearded Eddic Thor has long been embedded into the writing of even the scholarly giants of Scandinavian studies, in their standard dictionaries and public publications."
},{
  "_id": {
    "$oid": "60a8001a3caf2bc26219c067"
  },
  "link": "https://www.norsemyth.org/",
  "tags": [
    "mythology",
    "religion",
    "christianity",
    "mystery",
    "fiction"
  ],
  "text": "There seems to be something in the modern mind that craves specificity, that imposes concrete imagery onto textual traditions where that type of descriptive writing does not exist.Or perhaps it’s not so much an issue of the modern mind but of the post-pagan, post-polytheistic perspective. Snorri Sturluson, thirteenth-century author or compiler of what we now call the Prose Edda, determinedly included or invented small descriptive details that are not present in the poetic sources he prosified.The closer we get to the present, the more people seem to crave these sorts of details. From the retellings by William Morris in the nineteenth century to the transformations by J.R.R. Tolkien in the twentieth to the repackagings by Neil Gaiman in the twenty-first, the Snorrian impulse to muddle about with the texts and fill in the gaps seems irresistible.So much of modern reading of ancient myth views it as literature, as something that sits on the same shelf as the fairy tale and the fantasy novel. There is indeed a hostility in some parts of academia and some branches of postmodern Ásatrú and Heathenry to viewing the surviving Norse myths as at all religious, condemning them instead as products of medieval Christian authors that present hopelessly muddled and willfully distorted versions of what may never have been pagan tales in the first place.In a nutshell, the counterargument (of which I am a determined proponent) acknowledges the general scope of this criticism but counteroffers the mountain range of corroborating evidence and explicative theory from archaeology, linguistics, history of religions, and neighboring fields to argue that what Christian accretions have been sprinkled over the myths do not nullify the pagan mythological core at the heart of the surviving texts.It is the very turning away from reading the myths as literature to reading them in the wider context of specifically religious texts of related world religions that leads to a better answer for those students asking about eyes and faces, cats and mistletoe."
},{
  "_id": {
    "$oid": "60a801ff3caf2bc26219c068"
  },
  "link": "https://www.norsemyth.org/",
  "tags": [
    "mythology",
    "religion",
    "christianity",
    "history"
  ],
  "text": "“Wodan,” wrote Adam of Bremen in the eleventh century, “id est furor.” Wodan is fury, as his Icelandic counterpart Odin is furious (etymologically speaking). There are many historical accounts and semi-historical saga descriptions of bloody sacrifices to the bloodthirsty god who is often connected to the causes, manifestations, and consequences of killing and war.\n\nYet the image of Odin as the wandering wizard endures, shaped into the Wanderer by Richard Wagner and morphed into Gandalf by J.R.R. Tolkien. How do we reconcile the furious figure who hovers over the battlefield with the wise walker along ancient paths?\n\nThousands of miles span the distance from India to Iceland, and thousands of years passed between the composition of the Mahābhārata and the transcription of the Norse myths, yet the parallels between the Vedic and Eddic mythologies have been known, studied, and disputed since Sir William Jones laid out the connections between Germanic, Indic, and other surprisingly related language groups in 1787 as the Indo-European theory was first formulated.\n\nJones was part of the British colonial administration in India, and his theories were filtered through the Romantic nationalism of the nineteenth century to provide theoretical, rhetorical, and propagandistic fodder for the Nazi horrors of the twentieth.\n\nThe old ideas of blond Aryan hordes riding out of the Caucasus to conquer the world have rightfully and righteously been dragged into the trash icon of academia’s shared desktop, but the fact of linguistic, cultural, ethical, mythical, and religious connections between members of the wider Indo-European family remain.\n\nMy copies of the ancient Sanskrit texts from India are covered by smudgy spiderwebs of my penciled notes, such as “cf. Hávamál,” “cf. Völuspá,” “blót,” and “reciprocal gifting.” On nearly every page of every text I’ve studied, there are amazing parallels to the Norse material, from outlines of myths shared by Indra and Thor to very specific healing spells that appear in ancient India as they do in medieval Germany.\n\nThese finds can be so exciting to someone as excitable as me on these subjects that, at one point while I was in divinity school, Prof. Wendy Doniger had to limit me to a set number of “ooh, this is just like that bit in Norse myth” exclamations in each class session.\n\nIt was one of these moments in class that enabled me to provide my own students with a deeper answer to their questions about Odin’s eyes and to find for myself a more meaningful understanding of the wide disparity between the war-inciter and the wanderer."
},{
  "_id": {
    "$oid": "60a8024d3caf2bc26219c069"
  },
  "link": "https://www.norsemyth.org/",
  "tags": [
    "mythology",
    "religion",
    "hinduism",
    "history",
    "fiction",
    "mystery"
  ],
  "text": "By the sixth book of the Sanskrit Mahābhārata, the warring parties whose rivalry has consumed the preceding five books are finally ready to face off in their ultimate battle. In the last moments before the combat begins, the great and supremely macho hero Arjuna gets cold feet.Looking across the battlefield, he sees that both armies are composed of his own “fathers, grandfathers, teachers, uncles, brothers, sons, grandsons, companions, fathers-in-law, and friends.” Consumed with compassion and despair, he tells his chariot driver that he will not fight against his own family members, and he throws down his bow and arrows.His chariot driver tells him that he is behaving in an unworthy manner and warns him against becoming klība, a Sanskrit term with a range of meanings focused on “unmanliness” that is similar to the Old Norse ergi. “Shake off this miserable weakness of heart and get up,” the driver admonishes the languishing hero.When Arjuna continues to complain of his concerns, his chariot driver begins an enormously lengthy lecture not only on the responsibilities of the warrior, but on a host of increasingly esoteric religious teachings.In fact, the chariot driver is the god Krishna, and the teachings he recites to Arjuna are the sacred text known as the Bhagavad Gītā (“Song of the Lord”).After Krishna finishes one section of his lessons for Arjuna by declaring that there is “no end to [his] divine manifestations,” the hero responds:You are just as you have described yourself, great lord; but I wish to see your majestic form, supreme person. Master, if you think I will be able to see it, then show me your imperishable self, lord of yoga.Krishna agrees to reveal his forms to Arjuna “in their hundreds and thousands: diverse, divine, and of many colors and shapes.” He tells the reluctant warrior to observe “the whole universe with its mobile and immobile aspects concentrated within [his] body.”Because this vision is too great for human eyes, he grants divine sight to Arjuna."
},{
  "_id": {
    "$oid": "60a803113caf2bc26219c06a"
  },
  "link": "https://www.norsemyth.org/",
  "tags": [
    "mythology",
    "religion",
    "hinduism",
    "history",
    "fiction",
    "mystery"
  ],
  "text": "The narrator describes Krishna’s “supreme, majestic form” as revealed at that moment.With many mouths and eyes and numerous wonderful aspects, with multiple divine ornaments and raised divine weapons, it bore celestial garlands and robes and was anointed with divine perfumes, composed of all marvels, godly, infinite, and facing all directions. If the light of a thousand suns rising at once were to appear in the sky, it might resemble the splendor of that great soul. [Arjuna] saw the entire universe with its various divisions concentrated there in the body of the god of gods.Arjuna bows his head and speaks mighty words in praise of Krishna’s great cosmic beauty, but he soon begins to testify to the great panic and enormous fear he feels when he sees Krishna’s “mouths like the fire of time” into which all the “heroes of the world of men” rush into “like the many rivers running into the sea,” to be crushed and devoured. As revealed to Arjuna, the “blazing mouths” of Krishna devour “all peoples, all worlds.”Krishna responds to Arjuna’s fear by declaring, “I am Time, the world destroyer, ripened, and here I am busy crushing the worlds.”The hero again bows, praises Krishna, finally realizing that the chariot driver he has palled around with is actually the mightiest of all deities.Arjuna apologizes for past familiarities and begs for an end to the overwhelming cosmic vision, asking Krishna to revert to a limited form that can be comprehended with normal human senses – to conform to the common image of the god as a young man with diadem, mace, and discus. “Change into your four-armed form, thousand-armed god of universal form!”Krishna obliges, and the lesson continues."
},{
  "_id": {
    "$oid": "60a8039d3caf2bc26219c06b"
  },
  "link": "https://www.norsemyth.org/",
  "tags": [
    "mythology",
    "religion",
    "christianity",
    "hinduism",
    "fiction",
    "mystery"
  ],
  "text": "Again, the “Song of the Lord” gives a hint. Krishna makes clear to Arjuna that he is in all the world and that he abides in all beings. I believe that we can find Odin within ourselves, for better or worse.\n\nHe is the fury that stirs poet, artist, dancer, and musician as they enter into a deeply creative state in which they lose track of time and mundane situation. When the guitarist is so concentrated on improvising in the moment that she doesn’t afterward remember making any conscious musical decisions, Odin is there. When the painter is so immersed in the work that she doesn’t notice the night’s passing until the beeping of her morning alarm finds her still brushing away, Odin is there.\n\nHe is also the fury that stirs runner, boxer, gymnast, and baseball player as they find the zone where conscious thought gives way to inspired action. When the boxer senses that the moment has come and explodes into a flurry of blows from all angles that brings the knockout, yet doesn’t feel or realize that his own nose is already broken, Odin is there. When the baseball player perceives the ball as floating gently over the plate in slow motion and hears no sound within an internal quietude as he slams the ball out of the park, Odin is there.\n\nThe overtaking of the conscious mind is not always so beautiful. Odin is also there when the abuser sees red and hurts without control. He is there when the police officer succumbs to fear and hate and empties his weapon into the back of a child. He is there when the soldier sees a friend fall and his mind snaps free of anything that would restrain his indiscriminate revenge. This is the truly overwhelming and terrifying Odin.\n\nWhat all of these experiences have in common is the feeling that something has entered the mind and overwhelmed everyday thought. Seeing red, entering the zone, getting lost in the creative moment – all have a sense of drunkenness about them, of intoxication.\n\nThe Norse myths capture this feeling by telling us that Odin lives on wine alone and shares out the mead of poetry that inspires the mind of the one who drinks it. The tenth-century Icelander Egill Skallagrímsson famously rails against the bloodthirsty Odin for taking the lives of his sons but thanks him for the gift of poetic skill that allows him to express his grief."
},{
  "_id": {
    "$oid": "60a8adc703567ada3b87ca63"
  },
  "link": "https://devdutt.com/articles/how-brahma-lost-his-position/",
  "tags": [
    "mythology",
    "religion",
    "hinduism",
    "fiction"
  ],
  "text": "In Vedic times, 3,000 years ago, Brahma referred to ‘brahman’, the impersonal divine energy linked to consciousness, spirit and meaning. Gradually, in Puranic times, 2,000 years ago, the idea of a god named Brahma emerged. This god created all life and established codes of civilised conduct, and dharma. This shift can be seen as the result of two factors: the rise of monastic orders like Buddhism and Jainism, and the increasing participation of common folk who had little patience with complex rituals and abstract ideas.In Vedic ritual manuals, Brahma was called Prajapati, god of progeny, who creates all living creatures in order to overcome his loneliness and to satisfy his hunger as per Brihadaranyaka Upanishad. In Mahabharata, Brahma tells Indra to perform rituals to remove the pollution resulting from his killing Vritra (a brahmin) and Namuchi (a friend). In Brahmanas, he takes the form of a boar called Emusha to raise the earth, and he takes the form of the fish who teaches Manu that dharma is about protecting the weak. These roles as boar and fish, that rescues the earth and establishes humanity, are eventually taken over by Vishnu’s avatars. In Ramayana, Brahma encourages Valmiki to tell the story of Ram. In Mahabharata, he encourages Vyasa to tell the story of the Pandavas.In the Puranas, he is no longer self-born (swayambhu); he is born from a lotus that emerges from Vishnu’s navel. He is not all-knowing; he is inspired to create women by seeing Shiva’s half-female form. He is linked to passion (kama) and death (yama), and, so in opposition to Shiva who is the destroyer of passion (kamantaka) and death (yamantaka). Further, Brahma gives demons boons that create trouble in the three worlds; he rectifies the damage by seeking intervention of Vishnu, Shiva and Devi.As per Jains scriptures such as Kalpasutra and Adipuran, culture is established not by Brahma, but by the first Trithankara (of this kalpa), Adinath Rishabha, who was identified with Brahma’s Vedic titles such as Prajpati and even Hiranayagarbha. While Brahma was called Hiranya-garbha or golden germ, that produces all life, Rishabha was called Hiranyagarbha as his birth was accompanied by a shower of gold. Rishabha teaches the world the 72 masculine crafts, the 64 feminine crafts, and divided the world into three categories of vocations: kshatriyas who govern, vaishyas who produce and trade goods, and shudras who provide service. His daughter Brahmi spread the art of writing, while his other daughter Sundari taught the art of counting and calculating.Buddhism turned Brahma into a minor, even confused, god who venerates Buddha. As per Brahmajala Sutta, those who followed Buddhist path, could be reborn as Brahma gods in special realms, above earth and above the paradise of gods known as Brahma-loka. Here they would have long lifespans, and no suffering, as they moved towards the highest goal of nirvana.In Buddhist art, Brahma is seen as requesting Buddha to teach his lore to the masses.Brahma is shown adoring Buddha, serving him, attending to his needs, even guarding him. There is one story of a higher god who falls from a higher heaven after exhausting his merits into the lower Brahma heaven. He assumes he is the first being and deludes himself to be the creator of later beings—the creator-god Brahma."
},{
  "_id": {
    "$oid": "60a8f5b903567ada3b87ca64"
  },
  "link": "https://devdutt.com/articles/tamed-by-buddhism/",
  "tags": [
    "mythology",
    "religion",
    "buddhism"
  ],
  "text": "Buddha taught the sacred lore (dhamma) that would end all suffering. Many of his students renounced society and became monks (bhikku) and nuns (bhikkuni) of his sacred order (sangha). They travelled everywhere spreading Buddhist ideas. The people they encountered had their own gods—friendly or dangerous spirits who lived in rivers, rocks, ponds, trees, animals, and in cemeteries. These were the devas, asuras, rakshasa, yaksha, apsaras, naga, preta, and pisachas.In Buddhist literature, we find tales of how Buddhist monks interacted with these beings and eventually converted them to the Buddhist way. These were never seen as false gods as in Christianity or Islam. They were just seen as junior or inferior gods, superior to humans, but trapped in the wheel of suffering and rebirths (samsara), seeking freedom (nirvana).In Buddhist literature, we find stories of how monks who did not follow the monastic rules and did not behave with dignity were tortured by these spirit-deities. Monks who were serene and calm and followed the Buddhist way, could face spirits bravely, drive them away, calm them down, and even get them to help communities. Thus, we find many Buddhist artworks showing rakshasa (fierce beings), yakshas (corpulent beings), nagas (serpent beings) and pretas (scary emaciated beings) around the Buddha, adoring him, serving him as doorkeepers and attendants, defending his stupas and viharas.In fact, in early days, Buddha himself was worshipped as a tree-spirit yaksha.Such art reveals how Buddhism was never hostile to the native beliefs of people. And how eventually, these native deities became subservient to the Buddha and appropriated into the wider Buddhist lore. In Sri Lanka’s ancient chronicles, we hear how the Buddha arrived to calm down the wild rakshasas and yakshas, who once inhabited the island. In contemporary Tibet, Bon gods have become part of Vajrayana Buddhist mythology, assisting Buddhist monks and Buddhist followers, making trouble if not respected.Buddhism spread across China from around second century via the Silk Road. The people there worshipped many Taoist gods and venerated ancestor spirits. Over time, people believed that if they provided food to Buddhist monks and built monasteries for them, they would reduce the suffering of dead ancestors, or ghosts. Those who did not treat Buddhist monks well were doomed to become hungry unhappy ghosts, with miserable rebirths.When Buddhism travelled to Burma around 10th century, people there worshipped special spirits known as ‘nat’ similar to ‘bhuta’ worshipped by Tulus of India. These ‘nut’ were spirits linked to health, wealth, fertility and luck. These ‘nat’ were seen as living in special heavens, above the human world, adoring the Buddha, as they gradually made their way towards enlightenment.In Hindu Puranas, this ability of Buddha to calm down powerful malevolent spirit-gods, and make them followers, was seen as ‘trickery’. Brahmins said that Vishnu took the form of the Buddha in order to trick asuras so that they gave up Vedic rites and could be easily defeated by devas. It reveals the ancient rivalry between Brahmins and Buddhists for patronage."
},{
  "_id": {
    "$oid": "60a8f66903567ada3b87ca65"
  },
  "link": "https://devdutt.com/articles/does-the-mahabharata-respect-womens-desire/",
  "tags": [
    "mythology",
    "fiction",
    "religion",
    "hinduism"
  ],
  "text": "The Bhil Bharata is a tribal version of the Mahabharata. There is much it shares with the classical Sanskrit Mahabharata. However, when it comes to women, it has an altogether different take. In this retelling, Goddess Shakti takes the form of an eagle and impales herself on the trident of the seven sages. From its bones is born Gandhari, the mother of the Kauravas. From its flesh and blood, is born Kunti, the mother of the Pandavas. One night the Pandavas discover the true nature of their mother Kunti. They find the gods, including Indra, coming down to earth and sweeping the floor. They prepare a seat for their mother, who arrives riding a wild buffalo with a lamp in her hand. This indicates that she is a goddess, revered even by the devas. Later, the five Pandavas find in a plantain grove, a fully-grown woman, Draupadi, inside a banana plant. Since all five of them find her simultaneously, she becomes their common wife. Bhim discovers that the eldest brother, Yudhishtir, fears his wife, massages her feet and fans her all night. On inquiry, Yudhishtir shows Bhim the true nature of Draupadi. They hide in a banyan tree and at night, find gods descending from the heavens and preparing a seat of gold for Draupadi, who arrives on a tiger, with a lamp in her hand. The Pandavas learn that their wife, like their mother, is a goddess.Only the phrase used for the goddess in Bhil literature is ‘Dayan Devi’. This reveals an ambiguous relationship of the goddess being both malevolent and benevolent. In one explanation, she exists to cause the destruction of those ‘civilised’ folks who arrogantly lay claim to the forests and seek to turn it into their habitation. As goddesses, women’s desire is paramount and sovereign, and men exist to satisfy them. Indrani, the wife of Indra, gets angry when Indra does not admonish the seven sages who make sexual passes at her. She decides to find another husband. The Kauravas refuse, the Pandavas refuse, and so she marries young Abhimanyu, the son of Arjun. In another story, the Pandavas try to collect water from a lake for a ritual. The Jal Jogini tells them they cannot collect the virgin waters unless they agree to marry her. Four Pandava brothers refuse to marry her and so they die. But the youngest, Sahadeva, agrees to marry her, but only after the ritual is complete. She agrees and brings the other brothers back to life. In another episode, Arjun has to go to the netherworld, to the Naglok or land of the serpents, to find special gold. But there he is bitten by snakes and he dies. The snake princess finds Arjun. She is smitten by his looks and decides to revive and marry him. Unfortunately, the father does not give her the nectar of immortality. This angers her and she threatens to immolate herself unless her father does what she desires. The father has no choice but to revive Arjun, and let her marry his daughter. Perhaps the most scandalous of the stories is where Vasuki goes to earth in search of the woman, a strand of whose hair lands up in Nag-lok. The woman turns out to be Draupadi. Vasuki wants to marry her. Arjun protests, so Vasuki just plucks a hair from his moustache, binds him up and hangs him on a peg on the wall. He then ravishes Draupadi. Draupadi soon gets bored of Vasuki. So she enlists Arjun’s help to get rid of him. In the story, Arjun is angry with Vasuki for having relations with his wife, but at no point does he expect fidelity from his wife. In fact, she has the liberty to choose any man, and he strives hard to be the man of her choice. A similar theme is found in the Bhil version of Krishna’s relationship with Radha. In the Bhil version, Krishna and Radha are married. But soon after marriage, Krishna has to go to Dwaraka. This angers Radha who proceeds almost immediately to have an affair with a handsome bangle-seller, who eventually turns out to be Krishna himself. In this story, Krishna is not upset with Radha’s infidelity. He understands that a woman who is not treated well by her husband, has the right to go to another man. Most ‘modern’ men certainly do not believe in the sovereignty of women’s desire. They look down on such ‘tribal’ mindsets. This reveals how so-called cultured and civilised societies are essentially patriarchal."
},{
  "_id": {
    "$oid": "60a8f7f303567ada3b87ca66"
  },
  "link": "https://devdutt.com/articles/holi-for-shiva-holi-for-vishnu/",
  "tags": [
    "mythology",
    "religion",
    "hinduism"
  ],
  "text": "Why do we celebrate Holi? The standard answers we get in websites link Holi to Vishnu—he who preserves the world as per Hindu mythology. As the half-lion avatar Narasimha, Vishnu ensured the burning of the demoness Holika who, having the power to save herself from fire, sought to misuse her power, burning Prahalada, a devotee of Vishnu. Thus, the festival of Holi becomes one of the triumphs of Vishnu over those who oppose his worship.Then, there is the popular motif of Krishna and Radha playing Holi with flowers, sitting on a swing, as spring gives way to summer. The water is to cool them down. Not just the heat of the weather, but also of passion and love. This festival later became popular in Mughal and Rajput courts. It was played in the women’s quarters with husbands playing with wives and courtesans while musicians made music. Coloured fragrant water made from flowers, and the consumption of cannabis (bhaang), made it a fun event.But, why bhaang? Is that not linked to Shiva? Vishnu-worshippers will say it is linked to Krishna’s elder brother, Balarama, who also loved the intoxicant. It cooled him as he had a hot-temper. In many ways, Balarama is like Shiva. In fact, Balaram is identified as Shiva in the Puri temple of Odisha. Both are painted white in local art; Krishna is black. Radha is painted yellow and seen as the Goddess.Holi was once the festival of Madan, also known as Kama-deva, the god of love. The festival started in Vasant Panchami, start of spring, and continued till Holi, end of spring. Women would gather in parks and sing and dance, and embrace trees. Their laughter and touch would cause trees to explode into flowers and attract bees and butterflies. That was the belief. For, they were all favourites of Kama-deva.We have references to this festival in many Sanskrit plays. Women sat on the swing (dola), hence Dola Purnima, the full moon night of the swing, which eventually became Hola Purnima and then Holi. This festival is celebrated by Caribbean Hindus, who migrated out of India in 19th century as Phagwah, referring to the month of Phalgun.The Buddhists were not fond of Kama. They saw him as Mara, demon of desire, whose defeat resulted in the triumph of Siddhartha Gautama and his transformation into the Buddha. But, opposing this festival was problematic as people loved this festival. Even today, many Buddhist activists see this festival as casteist. In Thailand, we see that Buddhists participate in a Holi-like festival called Sonkran, where water is poured. A similar festival is celebrated in Myanmar. But this was celebrated a month later at the height of summer. No colour, only water.The festival occurs a fortnight after Shivaratri, the night of Shiva’s marriage. And this makes sense as Shiva is called Kamantaka, the destroyer of Kama, which causes winter misery. Plants shrivel and die. But then he marries Parvati and becomes Kameshwara, the lord of love, who even composes the Kama-sutra and passes it on to sages. And so, a fortnight later, Kama-deva is resurrected with the laughter of women and with colour. Love returns, in Holi. Destroyed the night before by fire, and restored the next day with water."
},{
  "_id": {
    "$oid": "60a8fd1e03567ada3b87ca67"
  },
  "link": "https://devdutt.com/articles/why-is-there-no-judgement-day-in-hinduism/",
  "tags": [
    "mythology",
    "religion",
    "hinduism"
  ],
  "text": "Hindus believe in rebirth and so greater value is given to debt to the world and liberation from the world, and less to what is right and wrong.Qayamat is an important concept in Islam. On this day, after death, humans will be judged. The good who followed Allah’s laws (halal) will go to heaven (Jannat) and the rest who broke Allah’s law (haram) will go to hell (Jahannum). This idea is painted by Michelangelo on the walls of the Sistine Chapel in Rome. Jesus, as son of God, oversees the rise of the good to Heaven and the fall of the bad to Hell. Such images are not found in Hindu mythology or on Hindu temples. The celestial realms and the dark realms of hell are all seen as limbs of the Hindu deity – Vishwapurusha who embodies the whole world. The many heavens are in the upper half of his body and the many hells are in the lower half of his body. Whether in Heaven or in Hell, as per Hindu mythology or theology, we are inside the body of God. Yes, in Garuda Puran, and popular art, there are images of demon-like creatures boiling, roasting, impaling, quartering, torturing the dead in hell (Naraka) but this is Yamaloka, the realm of the god of dead, and this not equated with Judgement Day. In fact, in Hinduism, there is no Judgement Day.This is because Hinduism is based on rebirth (punar-janma) while Judgement Day is found in cultures that believe in a single life, followed by an eternal afterlife. Ancient Egyptians believed in one life, and so their tombs are filled with all kinds of chants and goods to enable successful transition to the afterlife. Ancient Greeks also believed in one life. Their myths refer to three judges who decide the fate of the dead. Persians also believed in one life, but unlike Greeks and Egyptians, also believed in one God. They believed that when you die, you have to walk on a bridge which narrows if you are bad and widens if you are good. Thus, one can say Judgement Day was an idea meant to force humans to be good while they are alive. It was a lynchpin for social morality.In a rebirth culture, the kind of deeds we do in this life, determine our fortunes in the next life. So those who are fortunate in this life were beneficiaries of good deeds performed in their past life (punya karma). And those who do bad deeds in this life (paap karma) are said to suffer in their next life. The karma machine takes care of morality; there is no need for judges and judgement day. But Manu while writing Manusmriti realised that was no deterrent enough and so introduced the idea of many hells for crimes committed in this life, in addition to the karmic system. And so, the hells of Yama became a recurring theme in Hindu scriptures, reaching detailed form in the Garuda Purana. Yama, then becomes judge, and his scribe, Chitragupta, the accountant of paap and punya. But Yama’s judgement can be bypassed in two ways: by giving gifts to Brahmins (Manu was clearly favouring his own community) and by surrendering to the grace of Vishnu or Shiva (the writers were clearly marketing the bhakti philosophy).The Christian/Islamic worldview holds everyone is equal before God and so everyone has to follow the same set of rules (Commandments/Gospels/Quran/Hadith/Sharia). But the Hindu world was based on karma and so diverse, and grouped into categories (varna) and so rules were different for different communities. Everyone was judged by different yardsticks: the Shudra was expected to follow Shudra code of conduct and a Kshatriya a kshatriya code of conduct. So, there was no standard or uniform rule book.Additionally, Indian worldview did not segregate action as good/bad (halal/haram) but as debt-creating (paap) or debt-clearing (punya). Debts bind us to the wheel of rebirths. If we clear our obligations to society, to family, to nature and to culture, we are free (moksha). So, the binary is not Heaven or Hell but the Entrapment or Liberation. The Indian worldview is thus very different from the Christian/Islamic worldview.The modern Indian nation-state with its Constitution is based on the Christina/Islamic model of one rule for all citizens enforced through judges. A traditional Hindu model would have focussed less on legal equality and more on economic diversity – how the rich and the privileged and the elite have more debts to repay society. Yama, after all, is god of accountants."
},{
  "_id": {
    "$oid": "60a8ff8403567ada3b87ca68"
  },
  "link": "https://devdutt.com/articles/a-forgotten-buddhist-journey/",
  "tags": [
    "mythology",
    "religion",
    "buddhism"
  ],
  "text": "About 2,500 years ago, Buddha revolutionised the intellectual world with his idea that desire is the cause of suffering. He invented practices that would end desire and so suffering. He established a community of monks to carry forward his message. But as the centuries passed, the monks built on his ideas. This gave rise to many schools of thought. One such school of thought that emerged 500 years later, known as Mahayana (the greater vehicle), gave rise to a Sanskrit text known as Gandavyuha Sutra, which means the Excellent Manifestation Sutra.Legend has it that the Sanskrit text was sent by the king of Odisha to China. There, it was translated and now exists in Chinese form. What is remarkable about this text is that it uses pilgrimage as the method of achieving enlightenment, where you travel and meet many teachers, who are called “Kalyana Mitra” or friends who enable spiritual fulfilment. This is amongst the first books, where the idea of the guru, as we know it today, is established. Here, a student is expected to completely surrender to the guru, and not to use his own powers of discrimination.The text tells the story of a young merchant son called Sudhana, who meets 52 teachers. Nearly half of these teachers are women, a radical idea for its time. These women belong to different categories. Some are nuns, some are goddesses, some are queens, there is even a courtesan. Others include some kings, some monks. He also meets non-Buddhists, like a Brahmin and a rishi with matted hair. Every one of them gives him different visions that enable his spiritual growth.In the story of King Anala, we learn how violence is not violence but a vision for enlightenment. In the story of Vasumitra, a courtesan, we realise that her sexual act is actually not a sexual act. It is but a tool to achieve enlightenment. Thus, what we see is a function of our own ignorance. The wise see the world very differently.The Buddhism of this text has a wider vision with multiple Buddhas occupying multiple Buddha realms, surrounded by lotus flowers, bountiful wealth and adoring students. Here is the idea that practice of dhamma creates good karma. This, in turn, generates wealth, which is why the Buddha is always surrounded with gold and gems. Another idea that is reinforced is that the purpose of wisdom is to do good for all living beings. This book is clearly directed at wealthy patrons, including women, who supported the Buddhist monasteries. Some people have called it a proto-tantric text, as it refers to ritual mandalas, sexual practices and complete devotion to teachers.In this text, greater value is given to the Bodhisattvas who help human beings such as Maitreya, Manjushri and Samantabhadra. Buddhists are advised to pray to them and seek their help. Such beliefs have given rise to chanting practices popular in society today. Fulfilment of desires is not seen as incompatible with Buddha’s message."
},{
  "_id": {
    "$oid": "60a9095003567ada3b87ca69"
  },
  "link": "https://devdutt.com/articles/the-hamsa-hand/",
  "tags": [
    "religion",
    "islam",
    "jewis",
    "christianity",
    "mythology"
  ],
  "text": "The hamsa is a common symbol used across the Middle East as a good luck sign. Originating in Ancient Egypt probably, it is used to bring in prosperity and to ward off evil. The word hamsa means five and represents the five fingers of the hand.When the palm faces outwards, and upwards, in Hindu symbolism, it means abhaya, do not be afraid. When the palm faces outwards but downwards, it means varada, the symbol of donation or charity. Around the world, people comfort each other by raising the palm upwards. They provide food by turning the palm downwards. So, around the world, an upward pointing palm represents security and a downward pointing palm represents abundance. The hamsa represents a combination of the upward and downward pointing palms. This is why it lacks the asymmetry of a palm, but is very symmetrical, like two palms placed over each other. Thumbs appear on both sides. It is hung with the fingers upwards to protect a house. It is hung downwards to bring abundance into a house.The hamsa, in the Jewish tradition, is called the hand of Miriam. Miriam was the sister of Moses. It is said that wherever she went, there was a cloud above her head. This cloud gave shelter to the people from the blistering heat, as they travelled through the wilderness in search of the Promised Land. Wherever she travelled, water flowed beneath her feet, and quenched people’s thirst. In her house, there was always a warm loaf of bread to feed the hungry. So, she represented both nourishment and security, provided by a home. These gifts of cloud, water and bread were associated not just with Miriam, the sister of Moses, but also with Rebecca and Sarah. Rebecca was the wife of Isaac, the biblical patriarch, and Sarah was her mother-in-law, the wife of the first biblical patriarch, Abraham.In Christian traditions, the hand of Miriam becomes the hand of Mary. Mary becomes the mother, associated with providing food and shelter. This domestic bliss is often forgotten in grand transcendental conversations associated with Original Sin and Salvation, Heaven and Hell.In the Islamic tradition, it becomes the hand of Fatima. Fatima was the daughter of the Prophet Muhammad. The five fingers of the hand represent the great five leaders of the Islamic faith. They were Muhammad, his daughter, Fatima, his son-in-law, Ali and his grandchildren, Hassan and Hussein. This is part of the Shia tradition. This valorisation of the Prophet’s family is not accepted in Sunni traditions.Middle Eastern traditions, whether Judaism, Christianity, or Islam, are highly patriarchal. Therein, God is male, most of the prophets are male, and the issues dealt with are masculine like law. Yet, the female form slips in through the symbol of the hamsa and is now part of modern jewellery. An eye is often placed in the hamsa to ward off evil and give protection to people. It is the eye that pays attention to your problems and resolves them. This is very similar to the concept of darshan in Hinduism. Perhaps, the hamsa is a pagan symbol and appeals to the human need to address the primal fears of hunger and fear."
},{
  "_id": {
    "$oid": "60a909c303567ada3b87ca6a"
  },
  "link": "https://devdutt.com/articles/angels-in-islam/",
  "tags": [
    "religion",
    "islam",
    "christianity",
    "mythology"
  ],
  "text": "In Christian mythology, the Devil is an angel who disobeyed God. But, in Islamic mythology, angels do not disobey God. Creatures of light, they have no free will, and they bowed to Adam when God told them to. For them the Devil, Iblis, is a djinn, hence capable of disobedience. Like Christians, angels are a part of Islamic lore, but we don’t know much about them as Muslims forbid their depiction in art. When one goes to a mosque, one sees geometric art, never human forms, as depicting human forms is forbidden in Islam. But, not so in a Church. Hence, we don’t get to visualise Islamic angels as we visualise Christian angels such as seraphim, cherubs and archangels.Very few angels are mentioned in the Quran. Most names come from later Middle Eastern folklore. The Christian Gabriel becomes Jibra’il, Michael becomes Mika’il. The former is the messenger, who Prophet Muhammad first encountered, who guided the Prophet in many ways, and who led angels in war at the Battle of Badr, that enabled the Prophet Muhammad to defeat his enemies and return to Mecca. The latter is the angel of mercy, linked to righteous conduct and justice.Azrail is the angel of death, horrifying to the false and comforting to the true. He sits under a tree on whose leaves are written the name of all living creatures; when a leaf drops, it is time to fetch their souls. Israfil awaits God’s nod to blow the trumpet to announce the Day of Judgement. The first sound will end the world, the second will resurrect the dead so they can present themselves for final judgement (Qayamat).There is Habib, the angel who counsels humans who pray. Raad is the angel of thunder who watches over clouds and storms. Kiraman Katiban watches and records deeds of humans. Hamalat al Arsh carries the Throne of God and encircles it in prayer. Muqqabit is the guardian angel who ensures no human dies before it is time for death.Some angels exist as pairs. Malik is the guardian of hell who never smiles, and Ridwan maintains the gardens of paradise and is always smiling. Munkar and Nakir are caretakers of the grave, and the first to question those who have been recently buried if they have been faithful to God’s laws. Harut and Marut, who succumbed to temptations, and hang upside down in Babylon, teaching astrology and fortune telling, warn those who seek such occult powers of their futility.The existence of supernatural beings, angels and djinns, in Islamic lore reminds us that all humans yearn for powers that help them cope with fears about life and death. Many imagine God as a king with courtiers and knights, with gardens and prisons, and this is projected in stories and songs. They may not make scientific sense, but they do make powerful psychological sense. Humans need to feel their lives are being watched and their death will be supervised. When we read other people’s mythology, we have a choice: to mock them as false and irrational, or to empathise with the insecurities and anxieties. Everyone wants to argue if myths are true or false; but what we need is to accept that myths help cope with the horrors of life, that even science, or logic, cannot get rid of."
},{
  "_id": {
    "$oid": "60a90b2103567ada3b87ca6b"
  },
  "link": "https://devdutt.com/articles/the-transformation-of-king-ashoka-and-bill-gates/",
  "tags": [
    "business",
    "mythology"
  ],
  "text": "Stories of transformation are very impressive. Let’s take the example of Ashoka. Ashoka was a Mauryan prince who, 2300 years ago, killed his brothers to become the king of Pataliputra. He established a great empire through violence.He used brutal force to suppress all those who opposed him. At the battle of Kalinga, he massacred a large number of people who refused to pay tribute and accept him as their overlord. Then the story goes, he goes through a dramatic transformation.He is introduced to the world of the Buddha and finds peace in Buddhist doctrine. He becomes the good king who speaks of ethics, morality and the importance of taking care of his subjects, as if they were his children. Chanda Ashoka (the violent Ashoka) becomes Dhamma Ashoka (the peaceful Ashoka).The story of Ashoka’s transformation was popularised by Buddhist texts. We don’t know how historically accurate these are. It is clearly very good propaganda for Buddhism and how its doctrine transforms tyrants into decent human beings. It is a story that appeals to a large number of people.Information about Ashoka also come from his own edicts. In these he talks about his transformation and the importance of Dhamma. This is not quite Buddhism as much as a state policy which believes that the purpose of governance is to bring peace and joy to the land. It is considered a remarkable royal document for its time. Unfortunately, we don’t know if these edicts were simply propaganda, as we have no corroborative evidence from an uninvested party.Now let us look at the story of Bill Gates. Bill Gates’ story follows the exact same model as Ashoka. If somebody asks the youth of today about Bill Gates, they will talk about the Bill and Melinda Gates Foundation. This foundation is involved in charitable acts around the world. These include the development of vaccines, reduction of malnutrition and spreading education.However, 30 years ago, Bill Gates was a very different person. We knew him as the founder of Microsoft. He had a reputation of being hyper-competitive, verbally combative and highly aggressive in establishing his vast business empire.Some challenged the strategies and questioned his ethics. A simple Wikipedia search reveals how fierce he was. He always wanted to win in an argument. He would constantly run down his staff, telling them how stupid they and their plans were. He told them he was faster and better than all of them. He was sarcastic and would run them down. He was no doubt a genius businessman but not a good person.But as soon as he became the richest man in the world, he had a transformation, just like Ashoka. He got involved in charitable activities and is now known for his charity and philanthropy. He talks about Corporate Social Responsibility and the responsibility of capitalists to take care of the world.He is following the Ashoka model, turning a new leaf in the autumn of his life. This goodness follows success, it did not exist before success, and it was never a parallel path of success. It was simply a consequence of spectacular success, and the charity makes no dent to his fortune, just as Ashoka’s remorse in no way eroded the size of his empire.Goodness, in this popular narrative, is simply a payback. You pay back after you have taken! It is not something that defines you. It is only after you become successful, you pay back, because to be successful – the general assumption is – you have to do bad things. To be successful, you have to be violent, aggressive and competitive. Having achieved the senior position, the success that you desire, you go into philanthropic mode. Just like Ashoka. Just like Bill Gates.This reveals a spiritual deficiency. It assumes that good people cannot be successful and goodness is simply an obligation of success. Not a necessary human condition. If Bill Gates had not been successful, would he have been charitable?If Ashoka had not fought the Kalinga war and did not feel the aggressive need to kill his brothers and make himself king, could he still have been a good human being? If Bill Gates was not an aggressive, brutal, competitive, rude business man who wiped out small businesses to establish his empire, could he have been a charitable business man he is now?Why did Ashoka feel the need to advertise his goodness through edicts as Bill Gates does through his corporate communications team and repeated media coverage, including a recent web-series on his life, where most commentaries were by beneficiaries of his generosity?These are the questions we need to ask ourselves. And does it mean that charity can only be done by the rich? It makes generosity a function of wealth, not a function of being human."
},{
  "_id": {
    "$oid": "60a90ba303567ada3b87ca6c"
  },
  "link": "https://devdutt.com/articles/the-essence-of-the-bhagavad-gita/",
  "tags": [
    "religion",
    "business",
    "hinduism",
    "mythology"
  ],
  "text": "The Bhagavad Gita informs us that the world is made of two intertwined entities: the material (prakriti) and the spiritual (purusha). The latter is technically not an entity as it cannot be measured. It is what makes us alive.Matter has three qualities (guna): the lucid (sattva), the passionate (rajas) and the sluggish (tamas). Everything in nature displays these three qualities in different proportions. The human mind has decided that the lucid state (sattva-guna) takes us towards spirituality. Unfortunately, the human mind is drawn towards achievement and that stokes passion (rajoguna). It is also drawn towards laziness and that stokes sluggishness (tamo-guna).We are told that the world will be a better place if we choose sattva-guna over rajo- or tamo-guna. Yet, all children are encouraged to be aspirational, achievement driven, rather than contentment driven. This stokes rajo-guna. The child prefers getting lost in video games and self-gratifying partying. That generates tamo-guna.Most gurus tend to make a virtue of sattva-guna, traditionally associated with Brahmins as well as religious and spiritual activities. They present tamoguna, traditionally associated with Shudras or service-providers, as something to be frowned upon, but are reluctant to condemn rajo-guna, traditionally associated with Vaishyas and Kshatriyas, those involved in economic and political activity. But this reveals the typical class and caste bias of any elitist society: children and servants are lazy, leaders and entrepreneurs are hardworking, and holy men are just perfect.People look at the world around and blame the horrors around — obesity, war, poverty, pollution, climate change, hunger, crime — as tamo-guna, which has become a shorthand for negativity. But what causes tamo-guna? Is it the same as entropy or implosion, tendency to collapse, to give up energy? Does that make sattva-guna extropy, drawn up by energy, intelligence, until it becomes excessive and turns into rajo-guna resulting in explosion? These are typical engineering terms, from the world of physics, used for objects. They cannot be applied to organisms, especially humans — organisms with imagination.It has been observed that most activists in the world are from the field of humanities, and most terrorists are graduates with an engineering degree. Both are trying to save the world, change the world — their way. One uses psychological force of protest, the other uses physical force of violence. But each one believes they have the answer to the world’s problems. Both are led with rajo-guna, aspiration, desire, passion. Neither is sluggish or lazy. Both have problems with the rich and the powerful, who they feel suer from tamo-guna, as they are too lazy and too comfortable to challenge the status quo or hierarchy that benefits them. The rich and the powerful feel those who complain a lot suer from tamoguna. For Marists, tamo-guna is with holy men who sell the opiates of religion and spirituality to the rich and powerful. Everyone feels those they don’t like have tamo-guna, and what they do not like is tamo-guna. Thus Bhagavad Gita’s triguna theory is used by all to serve their own purpose. There is a different way to look at tri-guna. And it involves a radical re-reading of the Bhagavad Gita.The Bhagavad Gita insists that the spiritual exists both within organisms and without. So atma is within you and outside. We tend to see this as self and the infinite. To quote Meera’s famous lines, “I have no one in this world but you, Krishna.” So, a spiritual-seeker ( jiva-atma) finds himself lonely in the world, with only God (param-atma) as refuge. We are told that we are all like gopikas lost in the forest, seeking Krishna, yearning to bask in his glory, dance around him in Madhu-vana, like planets around the sun. Yet, does Krishna, who narrates the Bhagavad Gita to Arjuna, want Arjuna to forget the world, and focus on him, and do as he says? Is the confused Arjuna the embodiment of rajo-guna, and the selfish corrupt Kauravas the embodiment of tamo-guna, and Krishna’s yoga the path of sattva-guna? Or is there a different way to look at this?The Kauravas think of themselves only. That is because they have no faith in anyone or anything. Hence, the self-absorption. This is rajo-guna, the drive to be autonomous, independent, to care for no one as no one cares for you. The helpless and lost Arjuna is tamo-guna, hoping someone will save him, take care of him. Krishna is asking Arjuna to see the purusha around him, not some cosmic transcendental energy, but people around him: the para-atma (the other) not the param-atma (the innite). To empathise with them, to see their fear, their loneliness, which drives them to be greedy or lazy, succumb to rajas or tamas. And to be dependable enough to uplift others, until they are capable of uplifting still others. This makes Bhagavad Gita a journey from dependence (tamas) and independence (rajas) to dependability (sattva).Abrahamic faiths such as Christianity and Islam are linear faiths — between those who believe and an almighty God. This forms the template of most guru conversations, especially when the guru is presented as greater than mother, father and God. The sun with planets around. But Hinduism is a cyclical faith — located in the relationship between the self (jiva-atma) and the other (para-atma), the infinite others around us creating the innite divine (param-atma).The guru is supposed to redirect our gaze of the sun back to the earth, to people around us.As long as we don’t empathise with people, we will seek to isolate ourselves from the world (tamo-guna), like Shiva, or seek conquest over them (rajo-guna), like Brahma’s children, the devas and the asuras. Vishnu teaches us to descend down (avatarana) and uplift (uddhara) until those uplifted can uplift others. This empathy for others is sattva-guna, sorely missing in the modern discourse. In the end of the Mahabharata, when Yudhishtira is furious to find the Kauravas in heaven, Dharma tells him, “In life, Kauravas did not share the earth with Pandavas and in death Pandavas do not wish to share heaven with Kauravas. How are you different? How can you ever be truly liberated?”"
},{
  "_id": {
    "$oid": "60a90fa003567ada3b87ca6d"
  },
  "link": "https://www.moneycontrol.com/news/trends/features-2/reimagining-mythology-is-part-of-hindu-tradition-novelist-filmmaker-trisha-das-6889801.html",
  "tags": [
    "mythology",
    "fiction",
    "movies"
  ],
  "text": "A sequel of her book Ms Draupadi Kuru: After the Pandavas (HarperCollins, 2016), the racy, sassy roller-coaster ride, full of action, adventure, romance and comedy, is written as a kind of continuation of the Mahabharata set in the modern-day Kalyug in Delhi.Previously, Das has also written and directed over 40 documentaries in her filmmaking career, and won an Indian National Film Award (2005) as well as was UGA’s ‘International Artist of the Year’ (2003).She talks to us about the importance of reimagining and rewriting mythology from a female perspective, her earliest influences of Indian mythology, and incorporating comedy in a mythological context.The Kuru novels aren’t so much a retelling of the Mahabharata as they are a sequel of sorts. The story of Ms Draupadi Kuru picks up in the modern day, thousands of years after the end of the original Mahabharata. Draupadi and her friends come down to Delhi from heaven. In The Misters Kuru, the Pandava brothers follow their women to Delhi.My motivation was simple – I wanted to give these characters another shot at their lives, at reshaping their destinies. So many of them were forced into living lives they didn’t want to – being stripped of their kingdom, exiled, et cetera. I thought it would be fun to see what kind of lives they would choose, given the choice.What were some of your earliest influences when it comes to Indian mythology?My maternal grandfather started my fascination with mythology as a young child. He was religious, but in an inclusive way, and he told the best stories from both the Ramayana and the Mahabharata.I read various versions and interpretations of the Mahabharata growing up and, as an adult, delved into the Ganguli and Debroy translations, alternate versions like the Bheel Mahabharata and mythological fiction. I also used to watch the TV series every Sunday on Doordarshan and point out mistakes, which everyone in my house found thoroughly annoying.What do you feel about the conventional depiction of women in Indian mythology?It sucks. They’re praised not for their achievements, but for their sacrifices or their beauty. Any kind of resistance to being pushed around or attempt at self-determination is severely punished and the women constantly suffer for the stupid decisions of their menfolk. Consent is virtually non-existent – just ask any beautiful woman trying to have a bath in the forest.Apparently, a mythological woman only has influence over men if she has a tiny waist and lotus eyes or if she’s their mother.Recently, several authors have been reimagining and rewriting mythology, particularly from a female perspective. Why do you feel it is important to do this in contemporary times?To keep the stories relevant and relatable to the inhabitants of a modern society. That’s how the Mahabharata and the Ramayana have kept up with the times, instead of dying out like European mythologies.Millions of authors have rerecorded the epics over thousands of years, so rewriting and reimagining mythology isn’t a recent thing at all. It’s part of Hindu tradition.Would you say that feminism exists in the ancient Indian context?Yes and no. Feminism is a modern concept, but female power has existed in one form or the other throughout history. Women have always been influential, even when the official narrative didn’t support it. They worked from behind the scenes, or wielded power by dressing as men or becoming saints or a thousand other ways that circumvented the system. Nowadays, feminists are trying to change the narrative and modify the system – same result, different approach.Please give us instances of the comedy you have incorporated in a mythological context in your book.The humour comes across in the writing, not in the plot – mostly when the old and the new collide with each other – when Yudhishtra tries to understand the concept of a ‘brand’ or Draupadi mistakes a chandelier for a divine being, et cetera. They’re people who are thousands of years old, falling into a modern city so there’s obviously a lot of potential for comedy.Relate to our readers some instances of unconventional sex/romance in Indian mythology.Well, there’s Draupadi having five, legal husbands, which would be fairly scandalous these days. Sikandi is a gender-fluid character who borrows a penis from a yaksha, and the concept of niyoga, in which the wife of an infertile man can be impregnated by his brother. There are also instances of premarital sex, extramarital sex, voyeurism and incest.As a filmmaker, tell our readers what is the essence of a good documentary."
},{
  "_id": {
    "$oid": "60a9104903567ada3b87ca6e"
  },
  "link": "https://greekreporter.com/2021/05/15/medusa-the-most-fearsome-goddess-of-greek-mythology/",
  "tags": [
    "mythology",
    "fiction",
    "greek"
  ],
  "text": "The representation of females in Greek mythology, including the Gorgon Medusa, has often included frightening images and ideas showing men’s fear of female power and their need to control — or destroy — this power.Like the monsters Scylla and Charybdis as well as the Sphinx, Medusa, the “Gorgon,” was born from the gods herself.Μέδουσα, meaning “guardian, protectress,” who was also referred to as Gorgo, was one of the three monstrous Gorgons, generally described as winged human females with living venomous snakes in place of hair. Those who gazed into her eyes would turn to stone.Most sources describe her as the daughter of Phorcys and Ceto, although the author Hyginus makes her the daughter of Gorgon and Ceto.Medusa was beheaded by the Greek hero Perseus, who thereafter used her head, which retained its ability to turn onlookers to stone, as a weapon until he gave it to the goddess Athena to place on her shield. In classical antiquity the image of the head of Medusa appeared in the supposedly evil-averting device known as the “Gorgoneion.”In Ancient Greece, the Gorgoneion was a special apotropaic amulet showing the Gorgon head, used most famously by the Olympian deities Athena and Zeus: both are said to have worn it as a talisman, and often are depicted wearing it.It established their descent from earlier deities who were thought to remain powerful. Among other attributes, it was assumed by the rulers of the Hellenistic age as a royal aegis to imply divine birth or protection. It was shown, for instance, on the Alexander Mosaic and the Gonzaga CameoAccording to Hesiod and Aeschylus, she lived and died on an island named Sarpedon, somewhere near Cisthene. The 2nd century BC novelist Dionysios Skytobrachion places her somewhere in Libya, where Herodotus had said the Berbers created her story and image as part of their religion.Naturally, the Romans adopted the Medusa as part of their mythology as well.In Ovid’s work Metamorphoses, from the first century AD, Medusa was portrayed as a terrifying Gorgon whose serpentine locks of hair turned anyone who met her gaze into stone.Interestingly, like the Sphinx and Scylla and Charybdis in Greek mythology, Medusa ends up meeting her maker at the hands of a male hero. It does seem to beg the question — why are all the female monsters in Greek mythology killed by men?Perseus somehow manages to do the Medusa in, but only with the help of magical tools including winged sandals from Hermes; an invisibility cap of invisibility from Hades, the god of the underworld, and a mirror-like shield that belonged to Athena, the goddess of wisdom — and war.Some believe all the Gorgons, the trio of winged females with venomous snakes for hair,  descended from Gaia, the personification of Earth herself. Anyone who looked any of these powerful female figures in the face would turn to stone.Perhaps reflecting the fear men had — and truthfully, often still have — of being sucked into a relationship because of the irresistible attractions of females, Medusa was portrayed as both deceptively beautiful and hideously ugly; of these three, however, Medusa was the only mortal Gorgon.In the Roman poet Ovid’s version, Medusa had once been a beautiful maiden. However, after Poseidon, the sea god, raped her in the temple of Athena, the goddess sought revenge for the heinous act of defilement.But in an inexplicable cruelty, the goddess Athena herself — according to the male poet, of course — transformed Poseidon’s victim into a hideous monster.Perhaps reflecting the fear men had — and truthfully, often still have — of being sucked into a relationship because of the irresistible attractions of females, Medusa was portrayed as both deceptively beautiful and hideously ugly; of these three, however, Medusa was the only mortal Gorgon.In the Roman poet Ovid’s version, Medusa had once been a beautiful maiden. However, after Poseidon, the sea god, raped her in the temple of Athena, the goddess sought revenge for the heinous act of defilement.But in an inexplicable cruelty, the goddess Athena herself — according to the male poet, of course — transformed Poseidon’s victim into a hideous monster."
},{
  "_id": {
    "$oid": "60a910be03567ada3b87ca6f"
  },
  "link": "https://www.youtube.com/watch?v=Q9pr2Xxaagw",
  "tags": [
    "mythology",
    "fiction",
    "greek"
  ],
  "text": "Today we look at one of the most misunderstood characters in Greek mythology, Medusa. We examine how she became the monster that she is so widely regarded as. Mythology GreekMythology MythologyExplainedIf you enjoy mythology and folklore and want to learn more. Please consider subscribing to the channel to keep up to date with all the latest uploads and news. If any of your artwork has been used in a video of mine please don't hesitate to contact me and the appropriate credit can be given. "
},{
  "_id": {
    "$oid": "60a9112d03567ada3b87ca70"
  },
  "link": "https://www.foxbusiness.com/lifestyle/new-batman-series-caped-crusader-hbo-max-reimagined-mythology",
  "tags": [
    "movies",
    "comics",
    "fiction",
    "mythology"
  ],
  "text": "A new Batman series is making its way to HBO Max.The animated show, \"Batman: Caped Crusader,\" will be a joint project between HBO Max and Cartoon Network, according to a press release issued by WarnerMedia.Warner Bros. Animation, Bad Robot Productions and 6th and Idaho Productions are set to produce the \"reimagined\" series. 'THE BATMAN' STILL FILMING IN OVERSEAS DESPITE TIER 3 CORONAVIRUS RESTRICTIONSExecutive producers of the show, Bruce Timm, J.J. Abrams and Matt Reeves, are said to be putting a new spin on Batman’s mythology through a \"visionary lens,\" the press release states. \"We are beyond excited to be working together to bring this character back, to tell engrossing new stories in Gotham City,\" a joint statement from Timm, Abrams and Reeves says. \"The series will be thrilling, cinematic and evocative of Batman’s noir roots, while diving deeper into the psychology of these iconic characters. We cannot wait to share this new world.\" \"We are beyond excited to be working together to bring this character back, to tell engrossing new stories in Gotham City,\" a joint statement from Timm, Abrams and Reeves says. \"The series will be thrilling, cinematic and evocative of Batman’s noir roots, while diving deeper into the psychology of these iconic characters. We cannot wait to share this new world.\"Fans can expect to see \"sophisticated storytelling, nuanced characters and intense action sequences\" in the new show.\"It is always fun to feed the insatiable appetite fans have for all things Batman,\" said Tom Ascheim, the president of global kids, young adults and classics at Warner Bros. \"'Batman: Caped Crusader' will entertain first time and die-hard fans alike and, with such an impressive creative team in place, we know we have another future Batman classic in the making."
},{
  "_id": {
    "$oid": "60a94be303567ada3b87ca71"
  },
  "link": "https://www.scoopwhoop.com/entertainment/why-pingu-strange-show-we-saw-as-kids/?ref=page_cat",
  "tags": [
    "humor",
    "entertainment",
    "fact"
  ],
  "text": "Did you watch Pingu as a kid? Ignoring the fact that he was a strange penguin that went around his day drinking coloured water with a straw and annoying his little brother? Well, we've got news for you. Why was Pingu's dad always washing and hanging clothes when they didn't wear any?Why did we spot a black unitard drying in this episode? Were they pretending to be penguins?Pingu peed on the ground once and then wiped it with a towel? Off the ice? And his younger brother more than often casually peed on the ice as well. Pingu's mom not-so-casually used to bend him over the knee and spank him 6. Pingu's favourite sport was fish tennis, with a fish instead of a ball.Pingu had his very own rap song that would have flourished on TikTok.  . He had a moving bed that never ever made sense. What were these Swiss creators high on?"
},{
  "_id": {
    "$oid": "60a95cf803567ada3b87ca72"
  },
  "link": "https://www.scoopwhoop.com/humor/mischievous-kids/?ref=page_cat",
  "tags": [
    "humor",
    "entertainment"
  ],
  "text": "Loki Might Be The God Of Mischief But These Naughty Kids Are Another Level Kids are not nice people. Mostly they are little helpless humans who need other humans to make sure they live to see another day. But every once in a while, when they are not stealing for phones to play games, they are quite funny. 1. That went from Expelliarmus to Avada Kedavra very quick. 2. Oh, that poor bastard doesn't know what Lord Vader does to kids!3. Oh, that is going to cost a fortune to clean. 4. Oh God, why! 5. Basically the plot of Thor: Ragnarok. 6. The music makes this so much better.   We've all been here. You were either the hunter or the prey depending on who was born first.  Lot of Luke and Phil Dunphy vibes here. They better pay that poor Thanos every penny he deserves."
},{
  "_id": {
    "$oid": "60a95eb503567ada3b87ca73"
  },
  "link": "https://listverse.com/2021/05/19/10-movies-and-tv-shows-lost-from-public-view/",
  "tags": [
    "entertainment",
    "movies",
    "fact"
  ],
  "text": "A lot of work goes into the creation of a movie or television program such as writing the screen- or teleplay, pitching the idea to a production company, casting, and all the technical tasks which include cinematography, lighting and film editing—all coming together harmoniously to produce a masterpiece which will hopefully be appreciated for generations. And often such presentations do leave a long-lasting legacy, with movies such as The Wizard of Oz and It’s a Wonderful Life entertaining people for decades and decades. But sometimes movies simply disappear forever, falling from public view and memory due to age, mishap or scandal. Television programs often follow suit in entirety or by individual episode. There have also been actors whose entire careers have disappeared due to the ravages of time or political correctness. Here are a few examples of productions that have fallen into oblivion, and a couple that have miraculously made it back! One shining example of an entire career gone missing is the story of Valeska Suratt (1882-1962), an early twentieth-century actress who rose from a risque career in vaudeville to embrace a successful career on Broadway. She was known for her glamour and style, and she went on to star in eleven silent flicks by Fox studios from 1915 through 1917, recreating herself in vampish roles along the lines of the great Theda Bara.Suratt was truly an actress that should be held in high esteem but most people these days, with the exception of film historians, do not remember her due to two significant events. First, in 1928 she sued Cecil B. Demille, claiming he stole the scenario for a movie from her, and she was unofficially blacklisted in Hollywood where she never worked again. Then, years later in 1937, all eleven of her movies were destroyed in a fire at the building where they’d been stored in Little Ferry, New Jersey, wiping out all cinematic footage of her lively and highly-fashionable career. She was soon forgotten by the general public.In 1962 Valeska Suratt died at 80 in a nursing home, having for the most part vanished from public visibility, though in those bygone, post-WWI days of yore all eyes were upon her The aforementioned fire in 1937 at that New Jersey storage facility also took a bite out of the extensive Charlie Chan legacy, an empire that started in 1925 with the novel The House without a Key by Earl Derr Biggers, and would go on to include five more books, a comic strip, a 50’s tv show and a 70’s cartoon series. Four early movies from Fox studios were lost forever in that fire: Charlie Chan Carries On (1931), Charlie Chan’s Chance (1932), Charlie Chan’s Greatest Case (1933) and Charlie Chan’s Courage (1934). Each of these movies starred Warner Oland as Chan, and their absence is an unfortunate gap in the series of forty-four films featuring the wise and honorable detective.But Charlie Chan is not held as favorably in American society as he once was, at least amongst the populace who can still remember who he was. There has not been a theatrical release with Chan since 1981 (Charlie Chan and the Curse of the Dragon Queen), which prompted demonstrations from Chinese-American activists at filming locations and theaters due to his acquired ‘Uncle Tom’ status. The character of Chan has been notoriously played on the big screen by white actors in yellowface with their eyes taped to look Asian, and the chop suey accent combined with his wizened aphorisms are just a bit too un-PC for the public these days. This sentiment may actually be the bigger catalyst deciding the cultural perseverance of Charlie Chan than an old fire at a Fox storage facility.As the sleuth himself once said: All forgotten, like last year’s bird’s nest Another golden oldie lost forever is the film 4 Devils (1928), a melodramatic circus movie directed by the iconic F. W. Murnau for Fox Studios. It was originally released as a silent movie, then re-released with a partial soundtrack, which gave the film a certain progressive distinction up until one of the actresses, a beautiful, Broadway crossover named Mary Duncan, borrowed it for a party in Florida with her friends where she threw it into the ocean. But why in blazes would she do such a thing?Mary Duncan led a long and elegant life before passing in 1993 at the age of 98. Her escapades included a successful streak on Broadway, a short-lived but sexy career in Hollywood, and a marriage in 1933 to international polo star and businessman, Stephen Sanford. After marrying she retired from acting and became a seasoned philanthropist, ruling as the queen of Palm Beach society and walking amongst the ranks of Rose Kennedy and the Duke and Duchess of Windsor, so we can only speculate who her friends might have been at that party in Florida where she lost the film. Actually most of the story is hearsay possibly based on solid fact but retold so many times it has different versions. Duncan probably borrowed the film in the ’40’s sometime after WWII, which means it survived the Fox storage facility fire in 1937 only to sleep with the fishes a decade later. And all of the many accounts of this story are by word of mouth with conflicting details, some having her casting the film into the Pacific, some into the Atlantic, some into a swimming pool, and some have her destroying the film by fire. According to her own attestation she became concerned with the combustible nitrate in the film, and fearing it might explode she threw it into the ocean, unaware she’d been holding the only copy. But that itself adds to the mystery because 4 Devils was released twice, as a silent flick and then a talkie, and since it’s assumed Duncan only borrowed one version of the film historians are still hopeful that the other might turn up somewhere.Until that happens, perhaps another detail worth speculating upon is what they were drinking at that party, and how much. Most people consider Disney movies to be wholesome and entertaining, but The Walt Disney Company has a long history of including negative racial cliches in their features that many people have come to find objectionable. Probably number one on that list would be Song of the South (1946), which portrays blacks as being indifferent to the unequal society in which they live, and depicts racial stereotypes with such insensitivity that the term ‘tar baby’ is used in one of the animated scenes. By a modern-day perspective the characters’ cheerful acceptance of the social structuring of the Old South is disturbing, and many find it unsettling to watch a smiling, elderly Uncle Remus take a pleasantly-psychedelic stroll while singing Zip-a-Dee-Doo-Dah! This movie has not shown in theaters since 1986 and is not included in the Disney Plus streaming membership.Another major embarrassment for Disney was an explicitly racist scene from Fantasia (1940) in which black centaurettes with donkey legs are subservient to lighter-skinned centaurettes with horse legs, right down to shining their hooves. The scene was cut when the movie was released again in 1969. And the movie Dumbo (1941) certainly carries controversy when the young elephant meets a group of mocking black crows acting out in stereotypical Negro behavior, one of whom is actually called Jim Crow, named after a system of Southern laws which mandated racial segregation! Perhaps the worst example of racism in the film is the “Song of the Roustabouts”, which features faceless, black circus laborers in a very demeaning manner, even using the lyrics, “Grab that rope, you hairy ape.” Consequently, Disney Plus has removed this movie from subscribers whose profiles are under age 7.Other movies unavailable to young children on Disney Plus are Peter Pan (1953) for derogatory portrayal of ‘redskins’, and The Aristocats (1970) for a negative depiction of Asians through a singing Siamese cat with buck teeth and a cliched accent. It’s not just movies that are often forever lost; the small screen has it’s share of casualties also…Jack Paar took over the reins of The Tonight Show in July of 1957 as permanent host up until 1962, by which time, due to his popularity, the show had been officially renamed The Jack Parr Show. Paar had a unique approach with guests that was often very emotional, even to the point of weeping, and he helped make household names of Zsa Zsa Gabor, Liza Minnelli and Carol Burnett.But the episode which best displayed Paar’s emotionalism probably would be the one that aired on February 11, 1960. Very early into the show Paar learned that a joke he had made the previous evening had been censored by the network for using the abbreviation ‘W.C.’, short for water closet, which by the standards of the day was considered to be, literally, bathroom humor. Before walking off the show he told the audience, “I am leaving The Tonight Show. There must be a better way of making a living than this.” Hugh Downs filled in for him, but on March 7 of the same year Paar walked back on stage and told everyone, “As I was saying before I was interrupted…” After the audience’s laughter died down he went on, “I believe my last words were that there must be a better way of making a living than this. Well, I’ve looked…and there isn’t.”Jack Paar threw in the towel and left The Tonight Show in March of ’62, with Johnny Carson stepping in to replace him. Unfortunately, due to the high cost of broadcast videotape, most of the footage shot between 1957 through 1971 was lost when the tapes were reused, a process called ‘wiping’ which destroys the original content. Only a few Tonight Show episodes before ’72 have been reclaimed, some only partially, and mostly due to kinescopes, audiotracks or home movies with the camera aimed at the television.So…in 1960 Paar may have removed himself from The Tonight Show for almost a full month to make a point, but NBC studios removed visual evidence of his absence, and most of his tenure as host on the show as well, by ‘wiping’ it away. Oooh…the irony… It’s a shame when movies or tv shows are lost forever, but how about an entire network! The DuMont Television Network aired approximately two-hundred tv series from 1946 through 1956, so only individuals beyond the age of retirement might actually remember viewing them. All of their programs aired live and weren’t filmed for future viewing due to a tight budget, and even though kinescopes (recordings of monitors playing the program) were occasionally made, most of them have not survived the decades.Unlike NBC and CBS, broadcast competitors whose television endeavors both sprang from successful radio networks, DuMont’s parent company, DuMont Laboratories, was a television equipment manufacturer. And it was genius of them to start creating programming content which would require televisions to watch! It worked well for a decade, and DuMont pioneered many insightful shows and formats, but they never achieved the financial freedom of their rival networks to keep up with their levels of quality production. ABC popped into the competition in 1948, and after merging with United Paramount Theaters in 1953 DuMont was pushed behind the other three networks in ratings. Things fell apart fast for DuMont at this point, and their last program, Boxing from St. Nicholas Arena, was aired in 1956.During its heyday, however, the DuMont Television Network was very innovative in developing new formats for programming. The very first American soap opera, Faraway Hill, appeared in 1946 on DuMont starring Flora Campbell. Unfortunately all episodes have been lost, and no stills, scripts or press materials from the show have ever been found, so not much is known about the serial except for the fact Ms. Campbell is credited with twelve episodes. Another example of breakthrough programming was the Hazel Scott Show (1950) hosted by pianist Hazel Scott, the first black individual in America to have her own tv show. Unfortunately her program lost its sponsorship after an accusation of communism was made about her, and it was cancelled almost three months after its premiere with no recorded evidence of its existence. And then there was Cash and Carry (1946-1947), and even though no footage of the show remains it still has the double distinction of being both the first game show and the first reality show.But traces of this mighty network’s short lifespan escaped obscurity, one fine example being Cavalcade of Stars (1949-1952), a variety show starring Jackie Gleason which performed comedic skits. A sketch called “The Honeymooners” aired in October of 1951, and characters were created that survived the death of the network to thrive on CBS as the Kramdens and the Nortons…extendedly the Flintstones and the Rubbles. MLB.com has been quoted as calling the final game of the 1960 World Series “maybe the greatest game seven in World Series Championship history.” And the late great Mickey Mantle of the New York Yankees has been known to say that the biggest disappointment in his baseball career was losing that series. But it was a high point for Bill Mazeroski of the Pittsburgh Pirates, who, in the ninth inning hit a walk-off home run out of the park, winning the game and concluding that year’s Fall Classic. This was a major disappointment for the Yankees, who had dominated the series, and for their fans. This was also a game worth rewatching, especially by Pirates fans, but that’s not how things worked back in 1960…Up until the 70’s television stations either reused or discarded the games they filmed, and while that was certainly cost effective it didn’t show a lot of foresight for NBC to not preserve the 1960 World Series, especially since Game 7 would come to be considered one of the most noteworthy games in the history of Major League Baseball. For almost fifty years the only coverage remaining from the game was the existence of old photos, newspaper stories and radio broadcasts, but that all changed in 2009 when Robert Bader, VP of Bing Crosby Entertainment, found two canisters of 16-millimeter film marked ‘1960 World Series’ in the wine cellar of the late Crosby’s home outside San Francisco!It seems Bing Crosby was a major fan and part owner of the Pirates until he died in ’77, but he chose to remove himself during the 1960 games due to being much too nervous to watch them play the Yankees, so he and his wife instead listened to the games on the radio while in Paris. But he paid a company to make a kinescope of Game 7 with the intention to watch if his team won after returning to the States. Oh what great luck for sports enthusiasts and collectors that the reels were stored in a cool, dry wine cellar where they were found nearly good as new! And after being doctored up and reformatted for DVD, with new, nostalgic content added, the 1960 World Series Game 7, once lost forever, is now available on Amazon. Traditionally a good scandal could help boost a performer’s career, such as a torrid affair or a much-publicized visit to rehab. Though bump the nature of the scandal up a notch and one might have become blackballed or, as they called it, run out of Hollywood! Today that concept unfolds in programs being dropped and content being removed from streaming services. Bill Cosby is a perfect example of modern-day banishment from public view, though ironically the scandal which brought him down propelled his name and reputation exponentially unto public scrutiny, mainly in news coverage and on social media. After the initial investigation into Cosby’s misconduct with women networks started dumping his much-beloved program, The Cosby Show (1984-1992), as far back as 2014. But after his guilty verdict in 2018 even Bounce TV, a digital broadcast network targeting black Americans, has pulled the plug on Cosby. Amazon Prime still offers the show, however.Hollywood scandals go way back, and the very first would probably be the three rape and manslaughter trials of comedian Fatty Arbuckle in November 1921 through April 1922. Arbuckle was also the first actor to reel in a million dollars per year, and he was at the height of his movie career with Paramount when the unthinkable occurred. Arbuckle and two friends threw a party in a San Francisco hotel which a young actress named Virginia Rappe crashed, and after growing ill she died four days later from a ruptured bladder after accusing the comic of rape. Even though doctors could not find evidence of assault, Arbuckle was arrested and tried for manslaughter three times, and the newspapers went wild with the allure of scandal! He was depicted as a brutish fiend whose excessive weight fatally injured the deceased during the alleged rape, and despite the fact he was acquitted the trials instantly ended his career when the motion picture industry officially banned his movies from theaters. The ban was lifted some months later but his movies still weren’t being shown, though ten years later he did make a comeback with Warner Brothers, signing a contract to make feature films in June of 1933. That very night he died of a heart attack in his sleep at the age of 46.Perhaps a classic example of scandal wiping away an actor’s work would be the ‘airbrushing’ of Kevin Spacey from the film All the Money in the World (2017) after accusations by several men of sexual misconduct. His replacement was Christopher Plummer, and the procedure gives renewed meaning to the term ‘wiping footage’! The Black Lives Matter movement has been around since 2013, founded after the acquittal of the man who shot and killed Trayvon Martin. But protests peaked anew in 2020 with unprecedented participation and visibility after the deaths of several individuals by the police, the most noteworthy and inflammatory being that of George Floyd. There has never beforehand been such a movement in terms of both numbers and volition in the history of the United States, and all across the country heads are turning and ears are listening—including Hollywood!One of the most controversial types of derogatory content on television has been the comedic practice of blackface, when a white person wears dark makeup or paint to resemble a black person usually to garner a laugh or two. Blackface song and dance, which arose in post-Civil War minstrel shows, generally attributed negative stereotypes such as ignorance, cowardice and laziness to African Americans. With the BLM protests of 2020 such imagery is quickly being purged from television, but are the expunged episodes equal in derision and ridicule to the old minstrel shows?Tina Fey, the creator and co-star of NBC’s 30 Rock, voluntarily removed four episodes from syndication in 2020 due to blackface humor, although one of the episodes simply involved the transplant of a set of hands from a black man onto a white guy. Other shows with episodes pulled from streaming by Hulu for blackface humor in 2020 are The Golden Girls and Scrubs, and that same year Adult Swim, the Cartoon Network’s evening block for mature audiences, started pulling episodes from three of its shows, Aqua Teen Hunger Force, The Shivering Truth, and The Boondocks, for containing racially-insensitive humor.And reality police shows are also taking quite a hit, the most notable being COPS, which Paramount Network took down after 32 seasons in June of 2020 following the death of George Floyd. Interestingly enough, as far back as 1989 a New York Times reviewer said of the show, “the overwhelmingly white troop of police are the good guys; the bad guys are overwhelmingly black.” They did start filming again in September, however, in Spokane County, Washington, though the new footage is intended only for foreign viewers and will not be aired in the US. Two similar shows that were cancelled are A&E’s Live PD and Investigation Discovery’s Body Cam, neither of which has resumed filming.Classic examples of how old film footage can be destroyed include fire, environment, and wiping or recycling, but technology has gone digital and so has Hollywood. Not only does digital content keep better and a lot longer, it’s also much more cost-effective to use while filming and later for storage. Plus the editing process, both video and audio, is light-years ahead of working with analog footage. That doesn’t mean the industry is free from problems, however—for instance, be careful with the delete button! The movie Toy Story 2 (1999) was almost completely deleted during the process of its creation back in ’98 when one of the animators over at Pixar Animation Studios accidentally executed the wrong command, and right before everyone’s eyes files began disappearing from the main server. By the time they pulled the plug on the server and took a toll of the damage they ascertained that the command had deleted 90% of their movie!It’s all about backup. During the production of Pixar’s A Bug’s Life (1998) the majority of ants were accidentally deleted, which was certainly an annoyance but not a tragedy as all their files were properly backed up. But with the Toy Story 2 accident that wasn’t the case. Unbeknownst to them their backup drive could only hold 4GB of data, compared to 10GB of movie, and new data saved was taking the place of older files. It’s quite a testament to the ingenuity of the studio and the long hours put in by staff members that Toy Story 2 met its release date in November of 1999.And this type of disaster can happen at home. A professional videographer in California initiated a lawsuit against Adobe for the loss of $250,000 of data, which includes files that were deleted both from his Premiere Pro Media Cache and from an external drive onto which he was attempting to back up content. It seems that a bug, which Adobe has both acknowledged and claimed to have fixed in 2017, wiped out 100,000 video clips holding 500 hours of digital footage, and the plaintiff has requested a jury trial to be awarded damages. This is actually a class action lawsuit, since many other Premiere Pro users in 2017 reported similar file losses. It seems digital content, haunted by the DEL key and the commands and bugs that can strike it, sometimes goes up in flames even quicker than the old-time analog film!"
},{
  "_id": {
    "$oid": "60a95fb003567ada3b87ca74"
  },
  "link": "https://www.scoopwhoop.com/entertainment/shows-you-can-watch-again/?ref=page_cat",
  "tags": [
    "entertainment",
    "movies",
    "webseries"
  ],
  "text": "10 Most Rewatchable Shows On The Internet That You Can Watch While You Decide Your Next Pick There is always something new on Netflix, Prime, and other platforms - but there is a certain comfort in watching shows you have already seen. In fact, there is a theory about why we go back to TV shows, it has something to do with familiarity. On that scientific note, let's look at the list of shows we think are the most watchable and easily available on the internet.1. Schitt's CreekHeartwarming, wholesome, funny - Schitt's Creek is a show you can never get enough of. It's something you can switch on whenever you feel low, and let the Rose family take matters from there. Trust me, they are very good with that responsibility.2. FleabagWhile I have watched around 10 times now (I have a problem, I know). It's the most well-written show of recent times, and if dark comedy combined with female rage, empowerment, and religion sounds like your thing, you have struck gold. It really doesn't get better than this. 3. F.R.I.E.N.D.SClassic. I didn't even need to put this on the list since most people have binge-watched it multiple times already. Though it would be good to have a marathon again, before the reunion episode.4. Brooklyn Nine-NineSeeing people solve crimes has never been more fun. Witty, sharp and fast, the show has some of the most memorable characters, and it provides entertainment and warmth without asking for much in return.5. Sarabhai Vs SarabhaiThe show is timeless, the jokes are still funny and Rosesh's poems are still relevant. There is no bad time to go back to Sarabhai Vs Sarabhai. It is one of the shows you can watch from any point and it wouldn't make a difference. 6. Russian DollNatasha Lyonne's Russian Doll was critically acclaimed but I still think it didn't get its due. It's the story of a woman who keeps coming back to life after dying. The concept isn't entirely novel but Natasha's treatment of it is. Highly bingeable.7. The OfficeThe loyalists swear by it and for others, well, \"it gets funnier after the first season\". Jokes apart, it remains a fact that The Office is one of the most popular shows in history and there has to be a reason for that. 8. Parks and RecreationThis political mockumentary is watchable multiple times because of the way it is made. With the current political climate around the world, it sure deserves a watch.9. That '70s ShowBased on the lives of a bunch of teenagers, this can be your go-to if you're bored of watching F.R.I.E.N.D.S. though both are quite different in some ways. This is the Ashton Kutcher-Mila Kunas show, yes. 10. Breaking BadI personally won't watch it again, but I am putting it in the list because there are many people I know who would, and are. Guess it's about soaking in the brilliance again and again. "
},{
  "_id": {
    "$oid": "60a9611e03567ada3b87ca75"
  },
  "link": "https://www.scoopwhoop.com/entertainment/celebs-who-are-banned-from-other-countries/?ref=page_cat",
  "tags": [
    "entertainment",
    "celebs",
    "movies",
    "fact",
    "controversy"
  ],
  "text": "From Nudity To Gay Rights: Here's Why These 10 Celebs Were Banned From Countries Celebrities from across the world have been stopped from entering or performing in other countries, for various reasons. From racist remarks, to sexist decisions, here are 10 celebs who were banned from countries and why. 1. BeyoncéShe had a scheduled concert in 2007, which she cancelled due to the protests over her clothes and performances. According to the BBC, “Female performers at Malaysian concerts are required by government rules to cover up from shoulders to knees, with no cleavage showing.\" And so Beyoncé cancelled the concert, because allegedly, she wouldn't even be allowed to dance on stage. 2. Justin BieberThe singer was banned from China for his 'bad behaviour' in 2017. And similarly stopped from performing in Argentina in 2016 for allegedly beating a photographer in 2013, and stealing his money and gear. The singer was also accused of disrespecting Argentina's flag. Justin was also reported to be banned from Disneyland for a bit, for allegedly punching Mickey Mouse in the crotch, years ago. Ouch.  3. Miley CyrusIn 2009, Miley was banned in China when she posted a racist picture of herself, making what appeared to be slanted eyes. Chinese foreign minister, Yang Jiechi made a statement soon after saying, “Miss Cyrus has made it clear she is no friend of China or anyone of East Asian descent. We have no interest in further polluting our children’s minds with her American ignorance.” 4. Salman KhanAccording to reports that surfaced in 2015, Salman couldn't travel to Britain after the Supreme Court cancelled a court order that had put on hold his five year jail term in the 1998 poaching case. However, in 2017, he finally performed in UK after a 12-year hiatus, so we're guessing the ban was lifted or exceptions were made. 5. Katy Perry Reportedly, because Katy wore a sunflower dress during a performance in Taipei in 2015, and even waved the Taiwanese flag during the concert, she was banned in China in 2017. The reason for the outrage was that the sunflower had been adopted by anti-China protesters, and so her dress was deemed anti-national by China. 6. Selena GomezThe singer, actor and social activist was allegedly banned from Russia over her political opinions and for supporting gay rights. She was also banned from China in 2016, for posting a picture with the Dalai Lama years ago. This isn't the first time though, Maroon 5, Bon Jovi, Linkin Park, Harrison Ford and Lady Gaga are other celebs who are banned in China for the same reason. 7. KeshaIn 2013, Kesha’s concert in Kuala Lumpur, Malaysia, was canceled and she tweeted this - \"To be clear. I did NOT cancel. I was not allowed to play. And then I was going to play anyways and was threatened with imprisonment.\" The reason? The authorities believed she would \"hurt cultural and religious sensitivities\". 8. Paris HiltonIn 2010, Paris pled guilty to drug charges in Las Vegas, which is why she was later denied entry in Japan when she decided to enter the country days later when landed in her private jet. Gigi has been banned from China indefinitely in 2017, after a video of the model holding a Buddha cookie and squinted her eyes went viral. This racist gesture hasn't been forgotten by China. After his film, Seven Years in Tibet, was a roaring success, the actor faced a ban in China which lasted for over 20 years - up until 2016. All because he played the part of an Austrian mountain climber, Heinrich Harrer, who befriends the Dalai Lama during the period of China’s takeover of Tibet. "
},{
  "_id": {
    "$oid": "60a962e003567ada3b87ca76"
  },
  "link": "https://www.scoopwhoop.com/entertainment/engineers-who-went-on-to-become-famous-celebs/?ref=page_cat",
  "tags": [
    "celebs",
    "fact",
    "entertainment",
    "movies"
  ],
  "text": "19 'Engineers' Who Went On To Become Famous Celebs Engineering as a career choice has a whole fan club in our country. Whether that's desi parents, or kids who see attaining the degree the path to ultimate stability. But some of the most famous people we know chose different paths even after having an education in engineering. Curious? Read on to know more.  Biswa Kalyan RathA graduate from IIT Kharagpur, Biswa Kalyan decided to drop working in anything related to his field and transitioned to his passion of being a professional comic in 2014.  The heartthrob was in fact an engineering student at Rajiv Gandhi Institute of Technology, Mumbai. By the end of this under-grad, he knew he didn't want to pursue the career any longer. And that was that, the moment a cute actor and celebrity was officially in the making.   R Madhavan is a mechanical engineering graduate from IIT Madras! Bet his batch mates, seniors and juniors talk about him and tell everyone stories of how they often saw him walking around campus, like a good engineering student. The actor-cum-humanitarian is a pass out from Yeshwantrao Chavan College of Engineering (YCCE), Nagpur with a degree in electrical engineering! Reportedly Kartik Aaryan's mom had said that the only way he could ever pursue acting was if he finished his degree in engineering. Cut to a few years later, and now he's a graduate in Biotechnology, from D. Y. Patil College of Engineering. Now that's what we call determination. This IIT Delhi graduate went on to become an actor post getting his degree, and how! From his roles in films such as Rocket Singh to TVF Tripling and Dolly Kitty Aur Woh Chamakte Sitare, he has done a solid acting job! Reportedly, the 238th Jee rank holder was an active participant in his college theatre society and learnt a lot about the craft during that time The Luka Chuppi actress is a graduate of Jaypee Institute of Information Technology, Uttar Pradesh, specifically in the field of Electronics and Communication. She debuted with a Telegu film, and then entered Bollywood. Although Ameesha Patel didn't graduate with a degree in engineering, she did initially choose an undergrad program in biogenetic engineering. But after two years of studying the subject, she switched over to economics. The actress is a graduate of Tufts University in Medford, Massachusetts The Pink actress has a degree in Computer Science Engineering from the Guru Tegh Bahadur Institute of Technology, Delhi. How very cool!  The late actor had achieved an All India Rank of 7 in the Delhi College of Engineering Entrance Examination in 2003. He went on to study mechanical engineering but dropped out in his third year to pursue his passion for acting. The TVF celeb is a graduate from IIT Kharagpur, and that too in the field of civil engineering. He was quite popular among the drama society in college, which is what ultimately led him to an acting career Very people know that Kader khan was a professor of civil engineering at M. H. Saboo Siddik College of Engineering, Byculla before he began his acting career. How very inspirational, guess there is no right age to start your dream job! The southern actor is a graduate in the field of Automobile Engineering. He got his degree from the College of Engineering, Guindy, USA, after which he went on to do an MS in Automobile Engineering from Eastern Michigan University.  Tamil films' actor Karthik Sivakumar did his graduation in mechanical engineering from Crescent Engineering College, Chennai. And then pursued Industrial Engineering from Binghamton University, New York. Another well-known south films' actor, Prasanna was studying engineering at Saranathan College of Engineering, when in his second year, he cleared an audition for a role in Manirathnam's Production. He decided to discontinue his degree and pursue his passion, and then, there was no looking back. Former Tamil actor turned stand-up comedian, Karthik Kumar has an education in chemical engineering from Sri Venkateswara College of Engineering, Chennai. How is it that most of these engineers end up becoming comedians, huh? The Kannum Kannum Kollaiyadithaal actor is a graduate in engineering from Malla Reddy Engineering College, Hyderabad. Reportedly, she used to bunk her classes quite a lot, but still managed to score well on exams! We have an all-rounder folks. I guess everyone knows of Kanan Gill and his educational background. The stand-up comedian is a graduate of M.S. Ramaiah Institute of Technology (MSRIT), and worked as a software engineer before finally making the career switch"
},{
  "_id": {
    "$oid": "60a963bc03567ada3b87ca77"
  },
  "link": "https://www.scoopwhoop.com/entertainment/tv-actor-deepika-singh-poses-with-fallen-tree-during-cyclone-tauktae-response/?ref=page_cat",
  "tags": [
    "celebs",
    "controversy",
    "facts",
    "entertainment"
  ],
  "text": "This TV Actress' Response For Posing With A Fallen Tree Amid A Cyclone Is Even More Tone Deaf As Mumbai struggles to remain afloat with Cyclone Tauktae and the government urges people to stay indoors, there are some who clearly didn't get the memo. Actor Deepika Singh Goyal considered the rain as an opportunity to do a photoshoot with some uprooted trees. The internet is calling out the actor for being insensitive and for promoting dangerous behaviour, especially in the middle of a storm. Deepika admitted that the pictures were taken by her husband, Rohit, outside their home when they both had stepped down a tree that had fallen on their car. She issued a statement about the same to a leading daily, saying that she had no regrets and was just trying to spread positivity, but would urge people not to do the same. I am sad for all those who were affected due to the cyclone and I didn't mean to be insensitive by posing near an uprooted tree. I would not encourage anyone to do something like that.The actor did not take down the pictures and videos from her Instagram post, despite being called out."
},{
  "_id": {
    "$oid": "60a9643c03567ada3b87ca78"
  },
  "link": "https://www.pinkvilla.com/entertainment/news/navya-naveli-showers-birthday-love-suhana-khan-sweet-throwback-cousin-alia-chhiba-shares-unseen-pics-747411",
  "tags": [
    "celebs",
    "fact",
    "entertainment"
  ],
  "text": "Navya Naveli showers birthday love on Suhana Khan with sweet throwback: Cousin Alia Chhiba shares UNSEEN PICS As Shah Rukh Khan’s daughter Suhana Khan turns a year older today, her BFF Navya Naveli Nanda and cousin Alia Chhiba wished her in the sweetest way possible. Shah Rukh Khan and Gauri Khan's daughter Suhana Khan is celebrating her 21st birthday today. Her close pals are leaving no stone unturned to make it a memorable affair. Her closest childhood friends Ananya Pandey, Shanaya Kapoor had wished the star kid in the sweetest way possible on social media. The Student of the Year 2 actress and Shanaya shared priceless childhood pictures with her. Now, her BFF Navya Naveli Nanda and cousin Alia Chhiba have penned heartfelt wishes for the birthday girl.Taking to her Instagram stories, Navya shared a throwback photo with the birthday girl Suhana. In the photo, Amitabh Bachchan’s granddaughter, SRK’s daughter, Ananya, and Shanaya can be seen all glammed up and posing for the camera. All can be seen beaming with joy and flaunting their radiant smiles in the group picture. Sharing the stunning click, Navya wrote, “Happy birthday cuteness.” On the other hand, Alia Chhiba shared a few rare candid pictures with Suhana. The monochrome photos show Alia kissing Suhana. Alongside it, she wrote, “bday kisses for my A1.” Suhana was quick to take note of it and commented, “Hehehehe  I love you so much,” followed by a heart emoticon. Earlier, Gauri Khan had wished her daughter, with a sweet post. She posted a picture of Suhana in a black-and-white polka dot outfit, and wrote in the caption, \"Happy birthday.... you are loved today, tomorrow and always.”Meanwhile, after graduating from Ardingly College in England, Suhana is currently studying films at New York University."
},{
  "_id": {
    "$oid": "60a964a003567ada3b87ca79"
  },
  "link": "https://www.pinkvilla.com/entertainment/news/akshay-kumar-reports-about-sooryavanshi-bell-bottom-s-independence-day-release-it-purely-speculative-747374",
  "tags": [
    "movies",
    "entertainment",
    "celebs"
  ],
  "text": "Akshay Kumar on reports about Sooryavanshi & Bell Bottom’s Independence Day release: It is purely speculative Akshay Kumar has addressed the speculations regarding the release of Sooryavanshi and Bell Bottom and stated that the makers will make the announcement at the right time. It has been a while since Akshay Kumar was last seen on the screen with his 2020 release Laxmii which had a digital release. Needless to say, his massive fan following has been eagerly waiting for the superstar to spill his magic on the big screen once again. While the Good Newwz actor has some interesting projects in his kitty, there have been speculations about two of his most talked about movies – Rohit Shetty’s cop drama Sooryavanshi and Ranjit M Tewari’s Bell Bottom. In fact, there have been reports that these movies are likely to have a release on Independence Day.However, Akshay has addressed the reports now and called it mere speculations. He also asserted that the makers will be making the announcement about the release at the right time. “I am humbled at the excitement and eagerness of my fans regarding the release of Sooryavanshi and Bell Bottom, and want to thank them from the bottom of my heart for all their love. However, at this point, it is purely speculative to say that both films will release on Independence Day. The producers of both films are working out the release dates and will make announcements at the right time,” the superstar was quoted saying.Apart from Sooryavanshi and Bell Bottom, Akshay will also be seen in Aanand L Rai’s Atrangi Re with Sara Ali Khan and Dhanush, YRF’s period drama Prithviraj opposite Manushi Chhillar, Farhad Samji directorial Bachchan Pandey and Abhishek Sharma’s Ram Setu with Nushrratt Bharuccha and Jacqueline Fernandez"
},{
  "_id": {
    "$oid": "60a9658403567ada3b87ca7a"
  },
  "link": "https://www.scoopwhoop.com/entertainment/shefali-shah-on-playing-akshay-kumar-mother-in-waqt-ageism-representation-in-bollywood-netflix/?ref=page_cat",
  "tags": [
    "celebs",
    "entertainment",
    "movies"
  ],
  "text": "While I Don't Regret Playing Akshay Kumar's Mother In 'Waqt', It Did Put Me Into A Category Back in the 90s, I was very lucky to be a part of television when the content, the characters, the story was paramount. Whether it was a Hasratein or a Banegi Apni Baat or Aur Shamma Jalti Rahi, or Daraar – these were really strong stories, well directed beautiful characters.A lot of these 90s shows, they were amazing shows with amazing story lines, talking about stuff that was probably taboo at that point of time. These weren't shows where the TRPs decided what happened to a character, whether he lives or dies, or they should introduce some other animals in the show, or make somebody into a Naagin. I mean the production value of shows really upped their game. They're equivalent to films and their costume and all of it. But that is the icing. I mean there is no cake. I do not think I am capable of doing that. It's probably not my strength, let's put it that way. I really cannot go back to it. And thanks to the kind of roles I was offered, that I decided to do and even OTTs to a large extent, I never had to. It started trickling in with Juice, and then Once Again, and then Delhi Crime, which changed everything for me. OTTs definitely have a huge role to play; not just for me, but even for the change in mindsets. There is definitely a lot more representation of such societal notions, changes, and it happens. Whatever is shown, whether it's talking about an extra marital affair, it's not breaking the sanctity of a marriage, but it's not that marriage isn't enriching the two people, is it worth going on is a question that deserves to be discussed and talked about. There is a stronger representation of the actual reality that goes around, whether people want to talk about it, accept it, not accept it, well, it's up to them. Everyone has a point of view and they justify it with what they think or feel. But, I don't think they can close their eyes and pretend it doesn't happen. We are getting to a place where we don't look at someone's age or gender as a factor. Age does not matter, period. There's no shelf life. When I pick a role, I'm not expecting to be a 22-year-old running around. I'm very proud of being 47 and I'm very proud of the work that I'm getting, which is in respect to my age. Which brings me to my role in a certain movie that starred Akshay Kumar as my son and Amitabh Bachchan as my husband. Waqt: A Race Against Time was based on a play that one of my very dear friends directed and when I saw it, I loved the film and I loved the role. I did not give the role of Sumitra Thakur much thought. There are mostly no thoughts. You see, I don't think with my brain, I feel with my heart. So if a role or a film appeals to me, I will do it. Even if it maybe a wrong decision. For instance, in 1995, I did an interview where I spoke about my character of Savi, in Hasratein - who is portrayed to be having an extra marital affair. I had said that, at that point of time, I wouldn't support the views of Savi who walked out of her marriage. But, I don't feel the same way as I did back then, because you're never in anybody's shoes to decide what the character decides. You don't know. It's very easy to sit outside and make a judgment and if I did make a judgment then I was stupid. Because you can never know what the person is going through because you're not standing in their shoes. So I definitely think I feel differently. Playing the role of Akshay Kumar's mother in Waqt did put me into a category, unfortunately. Which is strange, because I think the whole point of being an actor is to be able to do stuff that you actually aren't. Whether it's the caste, creed, colour, orientation, gender, age. I mean that's what is exciting as an actor, right? I mean, I would play a sofa if I had to and if it excites me. Also, it was not about playing a mother. During that time, what was happening with Indian cinema was that they just had a hero and a heroine. Everything else was frills. And they were just put into pockets – heroine ki behen, hero ka dost, villain, villain ka henchman, x ki mother, y ka father. They weren't individual strong characters which was silly. But that has changed a lot now. And yes, picking Waqt at that point of time has certainly hampered, probably, the work I would have gotten. But, I do not regret it. It was something that appealed to me and I did it. And I've changed the course now. I've chosen to change that course and I've been able to change the tide, which is great. In fact, even after Dil Dhadakne Do, I got offered films which were great banners, fantastic scripts, wonderful directors. One was Neerja and one was Kapoor & Sons. And I made the choice of saying 'No'. Because I thought I would fall into the same category as Neelam Mehra. And I loved both the films. And I absolutely loved the directors, I loved the scripts. But, it was just a conscious decision that I took. Also because I don't want to keep repeating what I do. Post Dil Dhadakne Do, I was trying to unwind, I was trying to go back and change that course of line for myself. Where I said 'Yes, I can be a Neelam Mehra and yes, I can be a Tara from Once Again. And Tara itself is also a mother. Vartika from Delhi Crime is also a Mom. I could be Juice. And that's what prompted everything that I did. It worked, touch wood, for me. And that prompted more directors to say that 'Okay, this is her age, let's accept it, no matter what she's done before. Let's just go by her talent and visualise her in something else'.   And so, today, I have a range of playing mid-30s to whatever I choose to be."
},{
  "_id": {
    "$oid": "60a9666203567ada3b87ca7b"
  },
  "link": "https://indianexpress.com/article/entertainment/television/aditya-narayan-dig-at-amit-kumar-7324255/",
  "tags": [
    "celebs",
    "entertainment",
    "tv",
    "bollywood"
  ],
  "text": "Aditya Narayan takes a dig at Amit Kumar, asks Kumar Sanu if he is praising Indian Idol contestants because ‘team asked him to’ Indian Idol 12 host Aditya Narayan took a jibe at Kishore Kumar's son Amit Kumar as he asked Kumar Sanu, Roop Kumar Rathod and Anuradha Paudwal whether they are praising contestants 'because the team asked them to'. Seems like Indian Idol 12 host Aditya Narayan has not taken singer Amit Kumar’s comments after the Kishore Kumar tribute episode lightly. After his recent visit to the reality show, Amit had criticised the talent and even accused makers of forcing him to praise every contestant. In the upcoming episode, Aditya will be seen asking guests on the show, Kumar Sanu, Anuradha Paudwal and Roop Kumar Rathod, if the words of encouragement they shared for Indian Idol contestants were from the heart or did the team ask them for it.In a video posted by Sony TV giving a glimpse of the weekend episode, Aditya is seen interacting with the guests. He says that before the show ends, he wants to ask something: “Aapne humare contestants ki jo itni taarif ki hai, dil se ki hai ya humare team se kisi ne bola hai karne ko (Was it honest praise or did the Indian Idol team asked you to do it)?”Taking the mike, Kumar Sanu replies to Aditya Narayan saying that it’s best that he asked, as he doesn’t want a controversy to stir up later. Sharing that whatever he said was ‘ekdum dil se’, the popular singer said, “They are really great singers and performed amazingly. All of them could pass off as playback singers right now. I have never seen so many talented people on one reality show. Each one of them is a heera (diamond).” Two weeks back Indian Idol 12 dedicated its episode to Kishore Kumar and welcomed Amit Kumar as a special guest. In an interview to ETimes, Amit said that he didn’t enjoy and wanted to stop the episode. The singer added that he was asked to praise every contestant irrespective of how they perform. “I did what I was told. I was told sabko praise kamana hai. I was told jo jaisa bhi gaaye usko uplift karna hai because it’s a tribute to Kishore da. I thought it will be a homage to my father. But once there, I just followed what I was asked to do. I had told them to give me portions of the script in advance, but nothing of that sort happened,” Kumar said. Two weeks back Indian Idol 12 dedicated its episode to Kishore Kumar and welcomed Amit Kumar as a special guest. In an interview to ETimes, Amit said that he didn’t enjoy and wanted to stop the episode. The singer added that he was asked to praise every contestant irrespective of how they perform. “I did what I was told. I was told sabko praise kamana hai. I was told jo jaisa bhi gaaye usko uplift karna hai because it’s a tribute to Kishore da. I thought it will be a homage to my father. But once there, I just followed what I was asked to do. I had told them to give me portions of the script in advance, but nothing of that sort happened,” Kumar said. "
},{
  "_id": {
    "$oid": "60a966fc03567ada3b87ca7c"
  },
  "link": "https://www.bollywoodhungama.com/news/features/korean-action-experts-injuries-rehearsals-randeep-hooda-shares-glimpse-making-smoke-fight-action-sequence-radhe-wanted-bhai/",
  "tags": [
    "movies",
    "entertainment",
    "celebs",
    "bollywood"
  ],
  "text": "Korean action experts, injuries and rehearsals: Randeep Hooda shares a glimpse into making of smoke fight action sequence from Radhe: Your Most Wanted Bhai Salman Khan’s Radhe: Your Most Wanted Bhai released this Eid and the action entertainer has already created history by garnering millions of views across platforms within days of release. Complete with all elements of a classic Salman Khan entertainer, the film has been received well. And one of the most talked about things in the film is its high-octane action sequences, the smoke fight scene being one of the most talked-about ones Makers of the film had especially roped in action choreographers from Korea, who had rehearsed extensively with Salman Khan, Randeep Hooda, Gautam Gulati, and Sangay Tsheltrim. Earlier today, Randeep Hooda, who plays the main antagonist in the film, shared a behind-the-scenes clip, where he can be seen rehearsing with the team for the smoke fight scene. In the clip, Randeep also revealed how he suffered a major kneecap injury while shooting for the scene. He also revealed how they shot for the sequence many times and eventually it was the first shot they did that was finally used in the film. Korean action experts, injuries and rehearsals: Randeep Hooda shares a glimpse into making of smoke fight action sequence from Radhe: Your Most Wanted BhaiByBollywood Hungama News NetworkCreated: May 22, 2021 - 12:12 PM ISTUpdated: May 22, 2021 - 2:03 PM ISTSalman Khan’s Radhe: Your Most Wanted Bhai released this Eid and the action entertainer has already created history by garnering millions of views across platforms within days of release. Complete with all elements of a classic Salman Khan entertainer, the film has been received well. And one of the most talked about things in the film is its high-octane action sequences, the smoke fight scene being one of the most talked-about ones.#Randeep HoodaKorean action experts, injuries and rehearsals: Randeep Hooda shares a glimpse into making of smoke fight action sequence from Radhe: Your Most Wanted BhaiRadhe – Your Most Wanted BhaiRadhe – Your Most Wanted BhaiRadhe – Your Most Wanted BhaiRadhe – Your Most Wanted BhaiRadhe – Your Most Wanted BhaiRadhe – Your Most Wanted BhaiRadhe – Your Most Wanted BhaiRadhe - Your Most Wanted BhaiNextMakers of the film had especially roped in action choreographers from Korea, who had rehearsed extensively with Salman Khan, Randeep Hooda, Gautam Gulati, and Sangay Tsheltrim. Earlier today, Randeep Hooda, who plays the main antagonist in the film, shared a behind-the-scenes clip, where he can be seen rehearsing with the team for the smoke fight scene. In the clip, Randeep also revealed how he suffered a major kneecap injury while shooting for the scene. He also revealed how they shot for the sequence many times and eventually it was the first shot they did that was finally used in the film.The movie is presented by Salman Khan films in association with ZEE Studios, produced By Salma Khan, Sohail Khan and Reel Life Production Pvt. limited. The movie has released in over 40 countries, including a theatrical release in major overseas markets on the occasion of Eid. The film will be available with ZEEPlex on the ZEE5 OTT platform and all leading DTH operato"
},{
  "_id": {
    "$oid": "60a967df03567ada3b87ca7d"
  },
  "link": "https://www.hindustantimes.com/entertainment/bollywood/anupam-kher-says-kirron-s-health-is-improving-reveals-robert-de-niro-checks-in-on-her-every-few-days-101621661708110.html",
  "tags": [
    "celebs",
    "health",
    "bollywood"
  ],
  "text": "Anupam Kher says Kirron's health is improving, reveals Robert De Niro checks in on her 'every few days' Actor Anupam Kher has provided a health update about his wife, Kirron Kher, whose cancer diagnosis he'd revealed recently. The actor said that the fight is 'tough', but that Kirron's health is improving. He also revealed that actor Robert De Niro has been checking up on her from time to time. Anupam worked with the Hollywood legend in Silver Linings Playbook.He told a leading daily, \"Kirron’s health is improving. It’s a tough treatment. She often says that the lockdown and COVID situation have made things difficult. Patients going through this treatment need something to distract themselves. She can’t go out or meet people, but the good part is that Kirron is on her way to better health. She is holding up fine. There are days when she is positive and then there are days when the chemotherapy impacts her state in many ways. We are all trying our best and she is doing it, too. The doctors do their job, but you have to keep your mental state strong to get past such a difficult treatment. She’s making every effort towards that, and so are we.\" He said that he reached out to De Niro after he saw a commercial in which the Oscar winner appeared with tennis legend Roger Federer. But all De Niro wanted to know was if Kirron was doing well. \"Robert had messaged me when he learned about Kirron’s health. He had also sent me a video to wish me on my birthday, and he keeps checking on Kirron’s health every few days. I had texted him after seeing his ad with Roger Federer, and in response, all he wanted to know was my family’s well-being and how Kirron was doing,\" he said. Kirron made her first public appearance after her cancer diagnosis when she stepped out with Anupam to get vaccinated against the coronavirus earlier this month. Anupam wrote in a note shared on Instagram and Twitter, \"There is a rumour going around about Kirron's health. It's all false. She is doing absolutely fine. In fact she got her second vaccination done for Covid this afternoon. I will request people not to spread such negative news. Thanks! Stay safe.\""
},{
  "_id": {
    "$oid": "60ab9d4d576b57940a30808d"
  },
  "link": "https://hollywoodlife.com/feature/who-is-chayce-beckham-american-idol-4368057/",
  "tags": [
    "entertainment",
    "celebs",
    "hollywood",
    "tv"
  ],
  "text": "We have a winner! Chayce Beckham was crowned the winner of season 19 of ‘American Idol’ during the show’s finale on May 23.It’s finale time on American Idol! The show’s season 19 finale aired live on May 23, and Chayce Beckham received the most viewer votes to be named the winner. He beat out fellow finalists, Grace Kinstler, who came in third place, and Willie Spence, who was this season’s runner up. After his incredible victory, here’s more to know about Chayce. 1. Chayce Came To ‘Idol’ After A Dark TimeThe year before Chayce auditioned for American Idol was not easy. “I’ve gone through a lot of ups and downs,” he said during his audition. “It’s been quite the roller coaster. My whole life kind of flipped upside down and I moved back home with my parents.” Although Chayce didn’t specify what happened, his mom got emotional while talking further about the situation. “He was on a dark path for a little while with drinking and his self worth and whether or not she was good enough,” she explained. “He went through some really hard times.”2. Chayce Was In A BandBefore starting to sing on his own, Chayce was in a band that sang reggae music. He’s brought quite a different sound to American Idol, though, right from his audition, where he sang “What Brings Life Also Kills” by Kolton Moore and the Clever Few. “I just started playing on my acoustic guitar and posted to my Instagram singing my own songs that I didn’t want to take to the band — stuff that I felt was kind of out of place, but I still enjoyed playing it,” Chayce explained. “That’s what got me here. I just started doing my own thing.”3. Chayce Works As A Heavy Machinery OperatorChayce gave fans a glimpse into his work during his American Idol audition. “I’ve been working for this company going on three years,” he said. “We rent out pretty much everything that has to do with construction. I kind of get to live out every little kid’s dream. I get to play with giant Tonka trucks all day!” Footage showed him operating one of the machines, as well.4. Chayce Is Extremely Close With His FamilyChayce credits his family and music with getting him through his darkest times. “I got pushed a lot by my parents and family [to be on American Idol],” he admitted. “They’ve been pushing me to do this stuff.” He added, “Without my family, I definitely wouldn’t be doing this. I told my mom the other day, ‘I owe you guys big time,’ and she said, ‘You don’t owe us anything, that’s what family’s for.'” Chayce also said that music was “always there” for him when “everything else was bad” in his life. “It would kind of keep me grounded at all times,” he revealed. “For me, it’s everything.”5. Chayce Is Also A SongwriterIn addition to being able to sing and play guitar, Chayce is also a songwriter who writes his own music. Although he’s been singing covers on American Idol, his songwriting skills are often showcased on his social media."
},{
  "_id": {
    "$oid": "60ab9ee3576b57940a30808e"
  },
  "link": "https://hollywoodlife.com/2021/05/23/billboard-awards-winners-2021-who-won-bbmas/",
  "tags": [
    "celebs",
    "music",
    "hollywood",
    "entertainment"
  ],
  "text": "The 2021 Billboard Music Awards has arrived and with so many talented nominees – from Ariana Grande to The Weeknd to Da Baby – find out which of your faves won big tonight.The 2021 Billboard Music Awards returned Microsoft Theater in Los Angeles on May 23 to honor some of the best talents in the music industry, who put out work one of the most difficult times in our history. The pandemic slowed down so much about our lives, but these artists still managed to put out incredible jams and albums: from Taylor Swift, who put out two albums in 2020, to The Weeknd, who has come out on top as a finalist in 16 categories, including top artist, top male artist and top Hot 100 artist. He won almost every category he was nominated for, including the top honor of Top Artist!But he has stiff competition to be sure. DaBaby is right on his heels as a finalist 11 times in nine categories, with double appearances in both top streaming song and top collaboration, and Pop Smoke is right behind him with 10 nominations. The big moment of the night belongs to Drake, though, as he’ll be honored with the Artist of the Decade Award. Considering he holds the title for most BBMAs with 27 wins, and possibly more tonight with 7 nominations, it’s no surprise he’s their choice.Meanwhile, powerhouse performer Pink has been selected to receive the Icon Award, following in the footsteps of fellow greats Jennifer Lopez, Mariah Carey, Celine Dion, and Janet Jackson. “It’s a huge honor,” Pink said on the red carpet before the show about receiving the award. “For me, it’s all about touring, so I’m sharing this with my crew.”But the first awards of the night were given to some of your faves before the show. First, for the 5th year in a row, BTS walked away with the award for Top Social Artist. Then, Taylor Swift snagged two big wins of the night as she walked away with Top Female Artist and Top Billboard 200 Artist! Finally, Doja Cat won live on the red carpet for top R&B artist femaleCheck out the full list below to see who wins throughout the night!Top ArtistDrakeJuice WRLDPop SmokeTaylor SwiftThe Weeknd — WINNERTop New ArtistGabby BarrettDoja CatJack HarlowPop Smoke — WINNERRod WaveTop Male ArtistDrakeJuice WRLDLil BabyPop SmokeThe Weeknd — WINNERTop Female ArtistBillie EilishAriana GrandeDua LipaMegan Thee StallionTaylor Swift — WINNER Top Duo/GroupAC/DCAJRBTS — WINNERDan + ShayMaroon 5Top Billboard 200 ArtistDrakeJuice WRLDPop SmokePost MaloneTaylor Swift– WINNERTop Hot 100 ArtistDaBabyDrakeDua LipaPop SmokeThe Weeknd — WINNERTop Streaming Songs ArtistDaBabyDrake — WINNERLil BabyPop SmokeThe WeekndTop Radio Songs ArtistJustin BieberLewis CapaldiDua LipaHarry StylesThe Weeknd –WINNERTop Social Artist (Fan Voted)BLACKPINKBTS — WINNERAriana GrandeSB19Top R&B ArtistJhené AikoJustin BieberChris BrownDoja CatThe Weeknd — WINNERTop R&B Male ArtistJustin BieberChris BrownThe Weeknd — WINNERTop R&B Female ArtistJhené AikoDoja Cat — WINNERSZATop Rap ArtistDaBabyDrakeJuice WRLDLil BabyPop Smoke — WINNERTop Rap Male ArtistJuice WRLDLil BabyPop Smoke — WINNERTop Country Female ArtistGabby Barrett — WINNER Maren MorrisCarrie UnderwoodTop Rock ArtistAC/DCAJRFive Finger Death PunchMachine Gun Kelly — WINNERtwenty one pilotsTop Latin ArtistAnuel AABad Bunny — WINNERJ BalvinMalumaOzunaTop Latin Male ArtistBad Bunny — WINNER J BalvinOzunaTop Billboard 200 AlbumJuice WRLD, Legends Never DieLil Baby, My TurnPop Smoke, Shoot for the Stars, Aim for the MoonTaylor Swift, folkloreThe Weeknd, After HoursTop R&B AlbumJhené Aiko, ChilomboChris Brown & Young Thug, Slime & BDoja Cat, Hot PinkKehlani, It Was Good Until It Wasn’tThe Weeknd, After HoursTop Rap AlbumDaBaby, Blame It On BabyJuice WRLD, Legends Never DieLil Baby, My TurnLil Uzi Vert, Eternal AtakePop Smoke, Shoot for the Stars, Aim for the Moon — WINNERTop Hot 100 Song Presented by Rockstar24kGoldn ft. iann dior, “Mood”Gabby Barrett ft. Charlie Puth, “I Hope”Chris Brown & Young Thug, “Go Crazy”DaBaby ft. Roddy Ricch, “ROCKSTAR”The Weeknd, “Blinding Lights” — WINNER Top Streaming SongCardi B ft. Megan Thee Stallion, “WAP”DaBaby ft. Roddy Ricch, “ROCKSTAR”Future ft. Drake, “Life Is Good”Jack Harlow ft. DaBaby, Tory Lanez, & Lil Wayne, “WHATS POPPIN”The Weeknd, “Blinding Lights” — WINNER"
}]